LeetCode - Pandas Question

In [1]:
import pandas as pd
import numpy as np

In [3]:
##595 - Big Countries

#DF
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

#Task
'''
A country is big if:

it has an area of at least three million (i.e., 3000000 km2), or
it has a population of at least twenty-five million (i.e., 25000000).
Write a solution to find the name, population, and area of the big countries.

Return the result table in any order.
'''

#Solution
world[(world['area']>=3000000) | (world['population']>=25000000)][['name','population','area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

In [4]:
##1757 - Recyclable and Low Fat Products

#DF
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})

#Task
'''
Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.
'''

#Solution
products[(products['low_fats'] == "Y") & (products['recyclable'] == "Y")][['product_id']]

   product_id
1           1
3           3

In [5]:
##183 - Customers Who Never Order

#DF
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

#Task
'''
Write a solution to find all customers who never order anything.

Return the result table in any order.
'''
##Solution 1
#customers.loc[~customers['id'].isin(orders['customerId'])].rename(columns = {'name' : 'customers'})[['customers']]

##Solution 2
customers[~customers.id.isin(orders.customerId)][['name']].rename(columns = { 'name' : 'Customers'})

  Customers
1     Henry
3       Max

In [6]:
##1148 - Article Views

#DF
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

#Task
'''
Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.
'''

#Solution
views[views['author_id'] == views['viewer_id']][['author_id']].rename(columns = {'author_id' : 'id'}).drop_duplicates().sort_values(by = 'id', ascending = True)

#Solution 2
views[views['author_id'] == views['viewer_id']][['author_id']].rename(columns = {'author_id' : 'id'}).sort_values(by = 'id', ascending = True).drop_duplicates(subset = 'id')

   id
5   4
2   7

In [7]:
##1683 - Invalid Tweets

#DF
data = [[1, 'Let us Code'], [2, 'More than fifteen chars are here!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

#Task
'''
Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Return the result table in any order.
'''

#Solution
tweets[tweets['content'].str.len()> 15][['tweet_id']]

   tweet_id
1         2

In [8]:
##1873 - Calculate Special Bonus

#DF
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

#Task
'''
Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number 
and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.
'''

#Solution
employees.assign(bonus = employees['salary'].where(
    (~employees['name'].str.startswith('M')) & (employees['employee_id'] % 2 >0),0)).sort_values('employee_id')[['employee_id','bonus']]

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

In [9]:
##1667 - Fix Names in a Table

#DF
data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

#Task
'''
Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.
'''

#Solution
users['name'] = users['name'].str.capitalize()
users.sort_values('user_id')

   user_id   name
0        1  Alice
1        2    Bob

In [10]:
#1517 - Find Users with Valid Emails

#DF
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})

#Task
'''
Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.
'''

#Solution
users[users['mail'].str.match(r'^[A-Za-z][A-Za-z0-9_.-]*leetcode[.]com$')]

Empty DataFrame
Columns: [user_id, name, mail]
Index: []

In [11]:
#1527 - Patients With a Condition

#DF
data = [[1, 'Daniel', 'YFEV COUGH'], [2, 'Alice', ''], [3, 'Bob', 'DIAB100 MYOP'], [4, 'George', 'ACNE DIAB100'], [5, 'Alain', 'DIAB201']]
patients = pd.DataFrame(data, columns=['patient_id', 'patient_name', 'conditions']).astype({'patient_id':'int64', 'patient_name':'object', 'conditions':'object'})

#Task
'''
Write a solution to find the patient_id, patient_name, and conditions of the patients who have Type I Diabetes. 
Type I Diabetes always starts with DIAB1 prefix.
'''

#Solution

patients[patients.conditions.str.contains(r'(^DIAB1)|( DIAB1)')]

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\1096965828.py:15: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  patients[patients.conditions.str.contains(r'(^DIAB1)|( DIAB1)')]

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

In [12]:
##177 - Nth Highest Salary

#DF
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['Id', 'salary']).astype({'Id':'Int64', 'salary':'Int64'})

#Task
'''
Write a solution to find the nth highest distinct salary from the Employee table. If there are less than n distinct salaries, return null.
'''
N = 2
#Solution
employee['rank'] = employee['salary'].rank(method='dense', ascending=False)
ranked = employee[employee['rank'] == N]
pd.DataFrame({f'getNthHighestSalary({N})': [None if len(ranked) == 0 else ranked['salary'].iloc[0]]})

   getNthHighestSalary(2)
0                     200

In [13]:
##176 - Second Highest Salary

#DF
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

#Task
'''
Write a solution to find the second highest distinct salary from the Employee table. 
If there is no second highest salary, return null (return None in Pandas).
'''

#Solution 1

f_salary = employee.drop_duplicates('salary')

if len(f_salary) < 2:
    pd.DataFrame({'Second Highest Salary': [None]})
else:
    f_salary['rank'] = f_salary['salary'].rank(method = 'dense', ascending = False)
    secondrank = f_salary[f_salary['rank'] == 2]
    secondrank = secondrank.rename(columns = {'salary' : 'SecondHighestSalary'})
    secondrank[['SecondHighestSalary']]

secondrank[['SecondHighestSalary']]


#Solution 2

df = pd.DataFrame({'SecondHighestSalary':[]})

if employee.salary.nunique()<2:
    df.loc[0, :]= np.nan #row label, column label
else:
    df.loc[0, :] = employee.salary.drop_duplicates().sort_values(ascending = False).iloc[1]
df


#Solution 3
s = employee['salary'].drop_duplicates().nlargest(2)
s = pd.DataFrame({'SecondHighestSalary': [s.iloc[1] if len(s) ==2 else none]})

s

#Solution 4
unique = employee.salary.drop_duplicates()

if len(unique)<2:
    pd.DataFrame({'SecondHighestSalary' : [None] })
else: 
    sort = unique.sort_values(ascending = False)
    second = sort.iloc[1]
    df = pd.DataFrame({'SecondHighestSalary': [second]})

df

   SecondHighestSalary
0                  200

In [14]:
##184 - Department Highest Salary


#DF
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

#Task
'''
Write a solution to find employees who have the highest salary in each of the departments.

Return the result table in any order.
'''

'''
#Solution - only have one largest
employee = employee.rename(columns = {'name' : 'Employee', 'salary' : 'Salary'})
department = department.rename(columns = {'name' : 'Department'})

employee = employee.merge(department[['id','Department']], left_on = 'departmentId', right_on = 'id', how = 'left')

employee.loc[employee.groupby('Department')['Salary'].idxmax()][['Department','Employee','Salary']].reset_index(drop = True)
'''

'''
Renaming Columns

df.columns = ['column1,'column2','column3']
Transform + groupby = Apply the result into each group
'''

#Solution
employee = employee.rename(columns = {'name' : 'Employee', 'salary' : 'Salary'})
department = department.rename(columns = {'name' : 'Department'})

employee = employee.merge(department[['id','Department']], left_on = 'departmentId', right_on = 'id', how = 'left')

employee.loc[employee.groupby('Department')['Salary'].rank(ascending = False, method = 'min') == 1][['Department','Employee','Salary']]

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

In [15]:
##178 - Rank Scores

#DF
data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

#Task
'''
Write a solution to find the rank of the scores. The ranking should be calculated according to the following rules:

The scores should be ranked from the highest to the lowest.
If there is a tie between two scores, both should have the same ranking.
After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.
Return the result table ordered by score in descending order.
'''

#Solution
scores['rank'] = scores['score'].rank(method = 'dense', ascending = False)
scores.sort_values('rank')[['score','rank']]

   score  rank
2    4.0   1.0
4    4.0   1.0
3   3.85   2.0
1   3.65   3.0
5   3.65   3.0
0    3.5   4.0

In [16]:
##196. Deletes Duplicate Emails

#DF
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

#Task
'''
Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.
For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.
For Pandas users, please note that you are supposed to modify Person in place.
After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.
'''

'''
inplace = True, modify the original data
'''

#Solution
person.sort_values('id').drop_duplicates(subset = 'email', keep = 'first')

   id             email
0   1  john@example.com
1   2   bob@example.com

In [17]:
##1795 - Rearrange Product Table 

#DF
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

#Task
'''
Write a solution to rearrange the Products table so that each row has (product_id, store, price). 
If a product is not available in a store, do not include a row with that product_id and store combination in the result table.
Return the result table in any order.
'''

melted = pd.melt(
    products,
    id_vars = 'product_id',
    value_vars = ('store1','store2','store3'),
    var_name = 'store',
    value_name = 'price',
)

melted.dropna(subset = 'price')

   product_id   store  price
0           0  store1     95
1           1  store1     70
2           0  store2    100
4           0  store3    105
5           1  store3     80

In [18]:
##1907 - Count Salary Categories

#DF
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

#Task
'''
Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

"Low Salary": All the salaries strictly less than $20000.
"Average Salary": All the salaries in the inclusive range [$20000, $50000].
"High Salary": All the salaries strictly greater than $50000.
The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.
'''

#Solution 1

i = accounts['income']

conditions = [
    (i < 20000),
    (i >= 20000) & (i <= 50000),
    (i > 50000)
]

choose = ['Low Salary', 'Average Salary', 'High Salary']

accounts['category'] = np.select(conditions, choose, default = 0)
accounts['category'] = pd.Categorical(accounts['category'], categories = ['Low Salary', 'Average Salary', 'High Salary'])


accounts.groupby('category', observed = False).agg(
    accounts_count = ('account_id','count')).reset_index()

#Solution 2
bins = [-np.inf, 20000, 50001, np.inf]

labels = ['Low Salary', 'Average Salary', 'High Salary']
accounts['category'] = pd.cut(accounts['income'], bins = bins, labels = labels, right = False)
accounts.groupby('category').size().reset_index(name = 'accounts_count')

#Solution 3
output = pd.DataFrame({
        'category' : ['High Salary', 'Low Salary', 'Average Salary'],
        'accounts_count': [len(accounts[accounts['income'] > 50000]),
                  len(accounts[accounts['income'] < 20000]),
                  len(accounts[(accounts['income'] >= 20000) & (accounts['income'] <= 50000)])
                    ]
    })

output

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\3871097727.py:43: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  accounts.groupby('category').size().reset_index(name = 'accounts_count')

         category  accounts_count
0     High Salary               3
1      Low Salary               1
2  Average Salary               0

In [19]:
##1741 - Find Total Time Spent by Each Employee

#DF
data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

#Task
'''
Write a solution to calculate the total time in minutes spent by each employee on each day at the office. 
Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.
Return the result table in any order.
'''

#Solution 1
employees['total_time'] = employees['out_time'] - employees['in_time']
employees.groupby(['event_day','emp_id'])['total_time'].sum().reset_index().rename(columns = {'event_day' : 'day'})

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-11-28       2          30
2 2020-12-03       1          41
3 2020-12-09       2          27

In [20]:
##511 Game Play Analysis

#DF
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

#Task
'''
Write a solution to find the first login date for each player.

Return the result table in any order.

column = player_id, first_login
'''

#Solution 1
activity.sort_values(by = 'event_date').drop_duplicates(subset = 'player_id', keep = 'first')[['player_id','event_date']].rename(columns = {'event_date' : 'first_login'})

#Solution 2
activity.groupby('player_id')['event_date'].min().reset_index().rename(columns = {'event_date' : 'first_login'})

#or 

activity.groupby('player_id').agg(
    first_login = ('event_date', 'min')).reset_index()

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

In [21]:
##2356 - Number of Unique Subjects Taught by Each Teacher


#DF
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

#Task
'''
Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Return the result table in any order.

columns = teacher_id, cnt
'''

#Solution 

teacher.groupby('teacher_id').agg(
    cnt = ('subject_id','nunique')).reset_index()

   teacher_id  cnt
0           1    2
1           2    4

In [22]:
##596 - Classes With at Least 5 Students

#DF
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

#Task
'''
Write a solution to find all the classes that have at least five students.

Return the result table in any order.

column - class
'''

#Solution 1
courses = courses.groupby('class')['student'].size().reset_index()
courses[courses['student']>4][['class']]

#Solution 2
(
    courses.groupby('class')
    .filter(lambda x: len(x) >=5)
    [['class']]
    .drop_duplicates()
)

Empty DataFrame
Columns: [class]
Index: []

In [23]:
##586 Customer Placing Largest Number of Orders

#DF 
data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

#Task
'''
Write a solution to find the customer_number for the customer who has placed the largest number of orders.

The test cases are generated so that exactly one customer will have placed more orders than any other customer.

column - customer_number
'''

#Solution
orders.groupby('customer_number')['order_number'].size().nlargest(1).reset_index()

   customer_number  order_number
0                3             2

In [24]:
##1484 - Group Sold Products By The Date

#DF
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

#Task
'''
Write a solution to find for each date the number of different products sold and their names.
The sold products names for each date should be sorted lexicographically.
Return the result table ordered by sell_date.

columns - sell_date, num_sold, products
'''

#Solution
(
    activities.groupby('sell_date')
    .agg(
        num_sold = ('product','count'),
        products = ('product', lambda x: ','.join(sorted(x.unique())))
        )
        .reset_index().sort_values('sell_date')
    )

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         2                          Mask

In [25]:
##1693 - Daily Leads and Partners

#DF
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})


#Task
'''
For each date_id and make_name, find the number of distinct lead_id's and distinct partner_id's.

Return the result table in any order.

columns - date_id, make_name, unique_leads, unique_partners
'''

#Solution
daily_sales.groupby(['date_id','make_name']).agg(
    unique_leads = ('lead_id', 'nunique'),
    unique_partners = ('partner_id','nunique')).reset_index()

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

In [26]:
##1050 - Actors and Directors who Cooperated at Least Three Times

#DF
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

#Task
'''
Write a solution to find all the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.
Return the result table in any order.

Columns - actor_id, director_id
'''

actor_director.groupby(['actor_id','director_id']).filter(lambda x : len(x) >= 3).reset_index()[['actor_id','director_id']].drop_duplicates()

   actor_id  director_id
0         1            1

In [27]:
##1378 - Replace Employee ID with the Unique Identifier

#DF
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

#Task
'''
Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.
Return the result table in any order.

columns - unique_id, name
'''

employees.merge(employee_uni, on = 'id', how = 'left')[['unique_id','name']]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

In [28]:
##1280 - Students and Examination

#DF
data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

#Task
'''
Write a solution to find the number of times each student attended each exam.
Return the result table ordered by student_id and subject_name.
columns - student_id, student_name, subject_name, attended_exams
'''

x = examinations.groupby(['student_id', 'subject_name']).size().reset_index(name = 'attended_exams')

(
    students.merge(subjects, how = 'cross')
    .merge(x, on = ['student_id','subject_name'], how = 'left').reset_index(drop = True)
    .fillna({'attended_exams' : 0})
    .sort_values(by = ['student_id','subject_name'], ascending = [True, True])
)

    student_id student_name subject_name  attended_exams
0            1        Alice         Math             3.0
1            1        Alice      Physics             2.0
2            1        Alice  Programming             1.0
3            2          Bob         Math             1.0
4            2          Bob      Physics             0.0
5            2          Bob  Programming             1.0
9            6         Alex         Math             0.0
10           6         Alex      Physics             0.0
11           6         Alex  Programming             0.0
6           13         John         Math             1.0
7           13         John      Physics             1.0
8           13         John  Programming             1.0

In [29]:
##570 - Managers with at Least 5 Direct Reports

#DF
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

#Task
'''
Write a solution to find managers with at least five direct reports.
Return the result table in any order.

Columns - name
'''

#Solution
employee

employee.groupby('managerId').size().reset_index(name = 'cnt').merge(employee,left_on = 'managerId', right_on = 'id', how = 'right').query('cnt>=5')[['name']]

   name
0  John

In [30]:
##607 - Sales Person

#DF
data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})

#Task
'''
Write a solution to find the names of all the salespersons who did not have any orders related to the company with the name "RED".

Return the result table in any order.

column - name
'''

#Solution 1
(
    sales_person.merge(orders[['sales_id','com_id']],on = 'sales_id', how = 'left')
    .merge(company[['com_id','name']], on = 'com_id', how = 'left', suffixes = ('', '_company'))
    .groupby('sales_id')
    .filter(lambda g: "RED" not in g['name_company'].values)
    [['name']]
    .drop_duplicates()
)

#Solution 2
data = orders.merge(company, on = 'com_id').query('  name == "RED"  ')['sales_id']
sales_person[~sales_person['sales_id'].isin(data)][['name']]

   name
1   Amy
2  Mark
4  Alex

In [31]:
##1378 - Replace Employee ID With The Unique Identifier

#DF
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

#Task
'''
Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.
Return the result table in any order.
The result format is in the following example.

column - unique_id, name
'''

#Solution
employees.merge(employee_uni, on = 'id', how = 'left')[['unique_id','name']]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

In [32]:
##1581 - Customer Who Visited but Did Not Make Any Transactions

#DF
data = [[1, 23], [2, 9], [4, 30], [5, 54], [6, 96], [7, 54], [8, 54]]
visits = pd.DataFrame(data, columns=['visit_id', 'customer_id']).astype({'visit_id':'Int64', 'customer_id':'Int64'})
data = [[2, 5, 310], [3, 5, 300], [9, 5, 200], [12, 1, 910], [13, 2, 970]]
transactions = pd.DataFrame(data, columns=['transaction_id', 'visit_id', 'amount']).astype({'transaction_id':'Int64', 'visit_id':'Int64', 'amount':'Int64'})

#Task
'''
Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.
Return the result table sorted in any order.
The result format is in the following example.

column - customer_id, count_no_trans
'''

#Solution 1
visits.merge(transactions, on = 'visit_id', how = 'left').groupby('customer_id').agg(
    count_no_trans = ('transaction_id', lambda x: x.isnull().sum())).reset_index().query('count_no_trans > 0')

#Solution 2
visits[~visits['visit_id'].isin(transactions['visit_id'])][['customer_id']].value_counts().reset_index().rename(columns = {'count' : 'count_no_trans'})

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\3777738636.py:20: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  count_no_trans = ('transaction_id', lambda x: x.isnull().sum())).reset_index().query('count_no_trans > 0')

   customer_id  count_no_trans
0           54               2
1           30               1
2           96               1

In [33]:
##197 - Rising Temperature

#DF
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

#Task
'''
Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).
Return the result table in any order.

column - id
'''

'''
#Solution 1
weather.sort_values('recordDate', inplace = True)
weather['prev_tempt'] = weather.temperature.shift(1)
weather['prev_date'] = weather.recordDate.shift(1)

weather[(weather['recordDate'] - weather['prev_date'] == '1 days') & (weather['temperature'] > weather['prev_tempt'])][['id']]
'''

#Solution 2
weather = weather.merge(weather, how = 'cross',suffixes = ('1','2'))
(
    weather
    [(weather['recordDate1'] - weather['recordDate2'] == '-1 days') & (weather['temperature2'] > weather['temperature1'])]
    [['id2']]
    .rename(columns = {'id2' : 'id'})
)

    id
1    2
11   4

In [34]:
##1068 - Product Sales Analysis I

#DF
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
data = [[100, 'Nokia'], [200, 'Apple'], [300, 'Samsung']]
product = pd.DataFrame(data, columns=['product_id', 'product_name']).astype({'product_id':'Int64', 'product_name':'object'})

#Task
'''
Write a solution to report the product_name, year, and price for each sale_id in the Sales table.
Return the resulting table in any order.

column - product_name, year, price
'''

#Solution

sales.merge(product, on = 'product_id', how = 'left')[['product_name', 'year','price']]

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

In [35]:
##1661 - Average Time of Process per Machine

#DF
data = [[0, 0, 'start', 0.712], [0, 0, 'end', 1.52], [0, 1, 'start', 3.14], [0, 1, 'end', 4.12], [1, 0, 'start', 0.55], [1, 0, 'end', 1.55], [1, 1, 'start', 0.43], [1, 1, 'end', 1.42], [2, 0, 'start', 4.1], [2, 0, 'end', 4.512], [2, 1, 'start', 2.5], [2, 1, 'end', 5]]
activity = pd.DataFrame(data, columns=['machine_id', 'process_id', 'activity_type', 'timestamp']).astype({'machine_id':'Int64', 'process_id':'Int64', 'activity_type':'object', 'timestamp':'Float64'})

#Task
'''
There is a factory website that has several machines each running the same number of processes. Write a solution to find the 
average time each machine takes to complete a process.The time to complete a process is the 'end' timestamp minus the 'start' timestamp. 
The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.
The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.
Return the result table in any order.

column - machine_id, processing_time
'''

'''
#Solution 1
pivot = activity.pivot(
        index = ["machine_id", "process_id"],
        columns = "activity_type",
        values="timestamp"
    )
pivot['processing_time'] = pivot['end']-pivot['start']
pivot.groupby('machine_id')['processing_time'].mean().reset_index().round(3)
'''

#Solution 2
activity = (
    activity
    .merge(activity, on = ['machine_id', 'process_id'], how = 'left',suffixes = ('1','2'))
)

activity = activity[(activity['activity_type1'] == 'start') & (activity['activity_type2'] == 'end')]
activity['processing_time'] = activity['timestamp2'] - activity['timestamp1']
activity.groupby('machine_id').processing_time.mean().reset_index()

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456

In [36]:
##577 - Employee Bonus

#DF
data = [[3, 'Brad', None, 4000], [1, 'John', 3, 1000], [2, 'Dan', 3, 2000], [4, 'Thomas', 3, 4000]]
employee = pd.DataFrame(data, columns=['empId', 'name', 'supervisor', 'salary']).astype({'empId':'Int64', 'name':'object', 'supervisor':'Int64', 'salary':'Int64'})
data = [[2, 500], [4, 2000]]
bonus = pd.DataFrame(data, columns=['empId', 'bonus']).astype({'empId':'Int64', 'bonus':'Int64'})

#Task
'''
Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.
Return the result table in any order.

column - name, bonus
'''

e = employee.merge(bonus, on = 'empId', how = 'left')
e[(e['bonus']<1000) | e['bonus'].isnull()][['name','bonus']]

   name  bonus
0  Brad   <NA>
1  John   <NA>
2   Dan    500

In [37]:
##1934 - Confirmation Rate

#DF
data = [[3, '2020-03-21 10:16:13'], [7, '2020-01-04 13:57:59'], [2, '2020-07-29 23:09:44'], [6, '2020-12-09 10:39:37']]
signups = pd.DataFrame(data, columns=['user_id', 'time_stamp']).astype({'user_id':'Int64', 'time_stamp':'datetime64[ns]'})
data = [[3, '2021-01-06 03:30:46', 'timeout'], [3, '2021-07-14 14:00:00', 'timeout'], [7, '2021-06-12 11:57:29', 'confirmed'], [7, '2021-06-13 12:58:28', 'confirmed'], [7, '2021-06-14 13:59:27', 'confirmed'], [2, '2021-01-22 00:00:00', 'confirmed'], [2, '2021-02-28 23:59:59', 'timeout']]
confirmations = pd.DataFrame(data, columns=['user_id', 'time_stamp', 'action']).astype({'user_id':'Int64', 'time_stamp':'datetime64[ns]', 'action':'object'})

#Task
'''
The confirmation rate of a user is the number of 'confirmed' messages divided by the total number of requested confirmation messages. 
The confirmation rate of a user that did not request any confirmation messages is 0. Round the confirmation rate to two decimal places.
Write a solution to find the confirmation rate of each user.
Return the result table in any order.

columns - user_id, confirmation_rate
'''

#Solution
data = signups.merge(confirmations[['user_id','action']], on = 'user_id', how = 'left')
data['confirmation_rate'] = np.where(data['action'] == 'confirmed',1,0)
data.groupby('user_id')['confirmation_rate'].mean().round(2).reset_index()

   user_id  confirmation_rate
0        2                0.5
1        3                0.0
2        6                0.0
3        7                1.0

In [38]:
##620 - Not Boring Movies

#DF
data = [[1, 'War', 'great 3D', 8.9], [2, 'Science', 'fiction', 8.5], [3, 'irish', 'boring', 6.2], [4, 'Ice song', 'Fantacy', 8.6], [5, 'House card', 'Interesting', 9.1]]
cinema = pd.DataFrame(data, columns=['id', 'movie', 'description', 'rating']).astype({'id':'Int64', 'movie':'object', 'description':'object', 'rating':'Float64'})

#Task
'''
Write a solution to report the movies with an odd-numbered ID and a description that is not "boring".
Return the result table ordered by rating in descending order.

columns - id, movie, description, rating
'''

#Solution

cinema[(cinema['id'] % 2 != 0) & (cinema['description'] != 'boring')].sort_values('rating', ascending = False)

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9

In [39]:
##1251 - Average Selling Price

#DF
data = [[1, '2019-02-17', '2019-02-28', 5], [1, '2019-03-01', '2019-03-22', 20], [2, '2019-02-01', '2019-02-20', 15], [2, '2019-02-21', '2019-03-31', 30]]
prices = pd.DataFrame(data, columns=['product_id', 'start_date', 'end_date', 'price']).astype({'product_id':'Int64', 'start_date':'datetime64[ns]', 'end_date':'datetime64[ns]', 'price':'Int64'})
data = []
units_sold = pd.DataFrame(data, columns=['product_id', 'purchase_date', 'units']).astype({'product_id':'Int64', 'purchase_date':'datetime64[ns]', 'units':'Int64'})

#Task
'''
Write a solution to find the average selling price for each product. average_price should be rounded to 2 decimal places.
If a product does not have any sold units, its average selling price is assumed to be 0.
Return the result table in any order.
g
columns - product_id, average_price
'''

#Solution
data = prices.merge(units_sold, on = 'product_id', how = 'left')
data['total'] = data['price'] * data['units']
data = data[(data.purchase_date.isna()) | ((data['purchase_date'] >= data['start_date']) & (data['purchase_date'] <= data['end_date']))]
data = (data.groupby('product_id')['total'].sum() /data.groupby('product_id')['units'].sum()).fillna(0).reset_index(name = 'average_price').round(2)    
data['average_price'] = np.nan_to_num(data['average_price'],0)
data

   product_id  average_price
0           1            0.0
1           2            0.0

In [40]:
##1075 - Project Employees I

#DF
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

#Task
'''
Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.
Return the result table in any order.

columns - project_id, average_years
'''

#Solution
project.merge(employee, on = 'employee_id',how = 'left').groupby('project_id')['experience_years'].mean().reset_index(name = 'average_years').round(2)

   project_id  average_years
0           1            2.0
1           2            2.5

In [41]:
##1633 - Percentage of Users Attended a Contest

#DF
data = [[6, 'Alice'], [2, 'Bob'], [7, 'Alex']]
users = pd.DataFrame(data, columns=['user_id', 'user_name']).astype({'user_id':'Int64', 'user_name':'object'})
data = [[215, 6], [209, 2], [208, 2], [210, 6], [208, 6], [209, 7], [209, 6], [215, 7], [208, 7], [210, 2], [207, 2], [210, 7]]
register = pd.DataFrame(data, columns=['contest_id', 'user_id']).astype({'contest_id':'Int64', 'user_id':'Int64'})

#Task
'''
Write a solution to find the percentage of the users registered in each contest rounded to two decimals.
Return the result table ordered by percentage in descending order. In case of a tie, order it by contest_id in ascending order.

Columns - contest_id, percentage
'''

#Solution
r = register.groupby('contest_id')['user_id'].count().reset_index(name = 'percentage')
r['percentage'] = (r['percentage']/len(users['user_id']))*100
r[['contest_id','percentage']].round(2).sort_values(by =['percentage','contest_id'],ascending = [False, True])

   contest_id  percentage
1         208       100.0
2         209       100.0
3         210       100.0
4         215       66.67
0         207       33.33

In [42]:
##1211 - Queries Quality and Percentage

#DF
data = [['Dog', 'Golden Retriever', 1, 5], ['Dog', 'German Shepherd', 2, 5], ['Dog', 'Mule', 200, 1], ['Cat', 'Shirazi', 5, 2], ['Cat', 'Siamese', 3, 3], ['Cat', 'Sphynx', 7, 4]]
queries = pd.DataFrame(data, columns=['query_name', 'result', 'position', 'rating']).astype({'query_name':'object', 'result':'object', 'position':'Int64', 'rating':'Int64'})

#Task
'''
We define query quality as: The average of the ratio between query rating and its position.
We also define poor query percentage as: The percentage of all queries with rating less than 3.
Write a solution to find each query_name, the quality and poor_query_percentage.
Both quality and poor_query_percentage should be rounded to 2 decimal places.
Return the result table in any order.

Columns - query_name, quality, poor_query_percentage
'''
#Solution 1
'''
queries.groupby('query_name').agg(
    quality = ('rating', lambda x: (x/queries.loc[x.index,'position']).mean().round(2)),
    poor_query_percentage = ('rating', lambda x: (sum(x<3)/len(x) * 100).round(2))).reset_index()
'''

#Solution 2
round2 = lambda x: round(x + 1e-9,2)

queries['quality'] = queries.rating/queries.position
queries['poor_query_percentage'] = (queries.rating < 3)*100

queries.groupby('query_name')[['quality','poor_query_percentage']].mean().apply(round2).reset_index()

  query_name  quality  poor_query_percentage
0        Cat     0.66                  33.33
1        Dog      2.5                  33.33

In [43]:
##1193 - Monthly Transactions I

#DF
data = [[121, 'US', 'approved', 1000, '2018-12-18'], [122, 'US', 'declined', 2000, '2018-12-19'], [123, 'US', 'approved', 2000, '2019-01-01'], [124,None, 'approved', 2000, '2019-01-07']]
transactions = pd.DataFrame(data, columns=['id', 'country', 'state', 'amount', 'trans_date']).astype({'id':'Int64', 'country':'object', 'state':'object', 'amount':'Int64', 'trans_date':'datetime64[ns]'})

#Task
'''
Write an SQL query to find for each month and country, the number of transactions and their total amount, 
the number of approved transactions and their total amount.
Return the result table in any order.

Columns - month, country, trans_count, approved_count, trans_total_amount, approved_total_amount
'''

#Solution 1
transactions['month'] = transactions['trans_date'].dt.strftime('%Y-%m')
transactions.groupby(['month','country'],dropna = False).agg(
        trans_count = ('id','count'),
        approved_count = ('state',lambda x: (x == 'approved').sum()),
        trans_total_amount = ('amount','sum'),
        approved_total_amount = ('amount', lambda x: x[transactions.loc[x.index, 'state'] == 'approved'].sum())
    ).reset_index()

,month,country,trans_count,approved_count,trans_total_amount,approved_total_amount
0,2018-12,US,2,1,3000,1000
1,2019-01,US,1,1,2000,2000
2,2019-01,NaN,1,1,2000,2000

In [44]:
##1174. Immediate Food Delivery II

#DF
data = [[1, 1, '2019-08-01', '2019-08-02'], [2, 2, '2019-08-02', '2019-08-02'], [3, 1, '2019-08-11', '2019-08-12'], [4, 3, '2019-08-24', '2019-08-24'], [5, 3, '2019-08-21', '2019-08-22'], [6, 2, '2019-08-11', '2019-08-13'], [7, 4, '2019-08-09', '2019-08-09']]
delivery = pd.DataFrame(data, columns=['delivery_id', 'customer_id', 'order_date', 'customer_pref_delivery_date']).astype({'delivery_id':'Int64', 'customer_id':'Int64', 'order_date':'datetime64[ns]', 'customer_pref_delivery_date':'datetime64[ns]'})

#Task
'''
If the customer's preferred delivery date is the same as the order date, then the order is called immediate; otherwise, it is called scheduled.
The first order of a customer is the order with the earliest order date that the customer made. 
It is guaranteed that a customer has precisely one first order.
Write a solution to find the percentage of immediate orders in the first orders of all customers, rounded to 2 decimal places.

Columns - Immediate Percentage
'''

#Solution 1
delivery = delivery.sort_values('order_date').drop_duplicates('customer_id')
immidiate_percentage = (delivery['order_date'] == delivery['customer_pref_delivery_date']).sum() / (delivery['order_date']).size
result = pd.DataFrame({'immidiate_percentage' : [immidiate_percentage]})
result

   immidiate_percentage
0                   0.5

In [45]:
##550 - Game Play Analysis IV

#DF
data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-03-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

#Task
'''
Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, 
rounded to 2 decimal places. In other words, you need to determine the number of players who logged in on the day immediately 
following their initial login, and divide it by the number of total players.

Columns - Fraction
'''
#Solution
activity = activity.groupby('player_id')['event_date'].min().reset_index().merge(activity, on = 'player_id', how = 'left', suffixes = ['','_2'])
a = activity[(activity['event_date'] - activity['event_date_2']) == '-1 days']

fraction = round(a['player_id'].nunique() / activity['player_id'].nunique(),2)
pd.DataFrame({'fraction' : [fraction]})

   fraction
0      0.33

In [46]:
##2356. Number of Unique Subjects Taught by Each Teacher

#DF
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

#Task
'''
Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Columns - teacher_id, cnt
'''

#Solution
teacher.groupby('teacher_id')['subject_id'].nunique().reset_index(name = 'cnt')

   teacher_id  cnt
0           1    2
1           2    4

In [47]:
##1141 - User Activity for the Past 30 Days I

#DF
data = [[1, 1, '2019-07-20', 'open_session'], [1, 1, '2019-07-20', 'scroll_down'], [1, 1, '2019-07-20', 'end_session'], [2, 4, '2019-07-20', 'open_session'], [2, 4, '2019-07-21', 'send_message'], [2, 4, '2019-07-21', 'end_session'], [3, 2, '2019-07-21', 'open_session'], [3, 2, '2019-07-21', 'send_message'], [3, 2, '2019-07-21', 'end_session'], [4, 3, '2019-06-25', 'open_session'], [4, 3, '2019-06-25', 'end_session']]
activity = pd.DataFrame(data, columns=['user_id', 'session_id', 'activity_date', 'activity_type']).astype({'user_id':'Int64', 'session_id':'Int64', 'activity_date':'datetime64[ns]', 'activity_type':'object'})

#Task
'''
Write a solution to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. 
A user was active on someday if they made at least one activity on that day.
Return the result table in any order.

Columns - day, active users
'''

#Solution 1
'''
a = activity.loc[(activity['activity_date'] > '2019-06-27') & (activity['activity_date'] <= '2019-07-27')]
a = a.groupby('activity_date')['user_id'].nunique().reset_index()
a.columns = ['day','active_users']
a
'''

#Solution 2
a = activity[activity.activity_date.between('2019-06-28','2019-07-27')]
a = a.groupby('activity_date')['user_id'].nunique().reset_index()
a.columns = ['day','active_users']
a

         day  active_users
0 2019-07-20             2
1 2019-07-21             2

In [48]:
##1070 - Product Sales Analysis III

#DF
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})

#Task
'''
Write a solution to find all sales that occurred in the first year each product was sold.
For each product_id, identify the earliest year it appears in the Sales table.
Return all sales entries for that product in that year.

Columns - product_id, first_year, Quantity, Price
'''

#Solution
a = sales.groupby('product_id')['year'].min().reset_index(name = 'first_year')
a.merge(sales, left_on = ['product_id','first_year'], right_on = ['product_id','year'], how = 'left')[['product_id','first_year','quantity','price']]

   product_id  first_year  quantity  price
0         100        2008        10   5000
1         200        2011        15   9000

In [49]:
##1729 - Find Followers Count

#DF
data = [['0', '1'], ['1', '0'], ['2', '0'], ['2', '1']]
followers = pd.DataFrame(data, columns=['user_id', 'follower_id']).astype({'user_id':'Int64', 'follower_id':'Int64'})

#Task
'''
Write a solution that will, for each user, return the number of followers.
Return the result table ordered by user_id in ascending order.

Columns - user_id, followers_count
'''

#Solution
followers.groupby('user_id')['follower_id'].size().reset_index(name = 'followers_count').sort_values('user_id')

   user_id  followers_count
0        0                1
1        1                1
2        2                2

In [50]:
##619 - Biggest Single Number

#DF
data = [[8], [8], [3], [3], [1], [4], [5], [6]]
number = pd.DataFrame(data, columns=['num']).astype({'num':'Int64'})

#Task
'''
A single number is a number that appeared only once in the MyNumbers table.
Find the largest single number. If there is no single number, report null.

columns - num
'''

#Solution
a = number.groupby('num').size().reset_index(name = 'cnt').query('cnt == 1').nlargest(1, 'num')[['num']]
if a.empty:
    pd.DataFrame({'num' : num})
a

   num
4    6

In [51]:
##1045 - Customers Who Bought All Products

#DF
data = [[1, 5], [2, 6], [3, 5], [3, 6], [1, 6]]
customer = pd.DataFrame(data, columns=['customer_id', 'product_key']).astype({'customer_id':'Int64', 'product_key':'Int64'})
data = [[5], [6]]
product = pd.DataFrame(data, columns=['product_key']).astype({'product_key':'Int64'})

#Task
'''
Write a solution to report the customer ids from the Customer table that bought all the products in the Product table.

columns - customer_id
'''

#Solution
a = customer.drop_duplicates(['customer_id','product_key']).groupby('customer_id')['product_key'].size().reset_index(name = 'cnt')
a[a['cnt'] == product.size][['customer_id']]

   customer_id
0            1
2            3

In [52]:
data = [[9, 'Hercy', None, 43], [6, 'Alice', 9, 41], [4, 'Bob', 9, 36], [2, 'Winston', None, 37]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'reports_to', 'age']).astype({'employee_id':'Int64', 'name':'object', 'reports_to':'Int64', 'age':'Int64'})

round2 = lambda x: round(x + 1e-9,0)

e = employees.merge(employees, left_on = 'reports_to', right_on = 'employee_id', how = 'left',suffixes = ['1',''])
e.groupby(['employee_id','name']).agg(
    reports_count = ('employee_id1','size'),
    average_age = ('age1',lambda x: round2(x.mean()))).reset_index()

   employee_id   name  reports_count  average_age
0            9  Hercy              2           39

In [53]:
##1789 - Primary Department for Each Employee

#DF
data = [['1', '1', 'N'], ['2', '1', 'Y'], ['2', '2', 'N'], ['3', '3', 'N'], ['4', '2', 'N'], ['4', '3', 'Y'], ['4', '4', 'N']]
employee = pd.DataFrame(data, columns=['employee_id', 'department_id', 'primary_flag']).astype({'employee_id':'Int64', 'department_id':'Int64', 'primary_flag':'object'})

#Task
'''
Employees can belong to multiple departments. 
When the employee joins other departments, they need to decide which department is their primary department. 
Note that when an employee belongs to only one department, their primary column is 'N'.

Write a solution to report all the employees with their primary department.
For employees who belong to one department, report their only department.

Columns - employee_id, department_id
'''

#Solution
a = employee[employee['primary_flag'] == 'Y'][['employee_id','department_id']]
b = employee.groupby('employee_id')['department_id'].size().reset_index(name = 'department_id').query('department_id == 1')[['employee_id']]
c = employee[employee['employee_id'].isin(b['employee_id'])][['employee_id','department_id']]
d = pd.concat([a,c], ignore_index = True)
d

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\2994556722.py:21: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  b = employee.groupby('employee_id')['department_id'].size().reset_index(name = 'department_id').query('department_id == 1')[['employee_id']]

   employee_id  department_id
0            2              1
1            4              3
2            1              1
3            3              3

In [54]:
##180 - Consecutive Numbers

#DF
data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

#Task
'''
Find all numbers that appear at least three times consecutively.

Columns - ConsecutiveNums
'''

#Solution
logs['prev1'] = logs['num'].shift(1)
logs['prev2'] = logs['num'].shift(2)
logs[(logs['num'] == logs['prev1']) & (logs['prev1'] == logs['prev2'])][['num']].rename(columns = {'num' : 'ConsecutiveNums'}).drop_duplicates()

   ConsecutiveNums
2                1

In [55]:
##1164 - Product Price at a Given Date

#DF
data = [[1, 20, '2019-08-14'], [2, 50, '2019-08-14'], [1, 30, '2019-08-15'], [1, 35, '2019-08-16'], [2, 65, '2019-08-17'], [3, 20, '2019-08-18']]
products = pd.DataFrame(data, columns=['product_id', 'new_price', 'change_date']).astype({'product_id':'Int64', 'new_price':'Int64', 'change_date':'datetime64[ns]'})

#Task
'''
Initially, all products have price 10.
Write a solution to find the prices of all products on the date 2019-08-16.

Columns - product_id, price
'''

#Solution
pid = products[['product_id']].drop_duplicates()  
last = products[products['change_date'] <= '2019-08-16'].groupby('product_id')['change_date'].max().reset_index()

last.merge(products, on = ['product_id','change_date'], how = 'left').merge(pid,on = 'product_id', how = 'right')[['product_id','new_price']].fillna(10).rename(columns = {'new_price' : 'price'})

   product_id  price
0           1     35
1           2     50
2           3     10

In [56]:
##1204 - Last Person to Fit the Bus

#DF
data = [[5, 'Alice', 250, 1], [4, 'Bob', 175, 5], [3, 'Alex', 350, 2], [6, 'John Cena', 400, 3], [1, 'Winston', 500, 6], [2, 'Marie', 200, 4]]
queue = pd.DataFrame(data, columns=['person_id', 'person_name', 'weight', 'turn']).astype({'person_id':'Int64', 'person_name':'object', 'weight':'Int64', 'turn':'Int64'})

#Task
'''
There is a queue of people waiting to board a bus. However, the bus has a weight limit of 1000 kilograms, so there may be some people who cannot board.
Write a solution to find the person_name of the last person that can fit on the bus without exceeding the weight limit. 
The test cases are generated such that the first person does not exceed the weight limit.

Columns - person_name
'''

#Solution
queue = queue.sort_values('turn')
queue['total weight'] = queue['weight'].cumsum()
queue[queue['total weight'] <= 1000].tail(1)[['person_name']]

  person_name
3   John Cena

In [57]:
##1978 - Employees Whose Manager Left the Company

#DF
data = [[3, 'Mila', 9, 60301], [12, 'Antonella', None, 31000], [13, 'Emery', None, 67084], [1, 'Kalel', 11, 21241], [9, 'Mikaela', None, 50937], [11, 'Joziah', 6, 28485]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'manager_id', 'salary']).astype({'employee_id':'Int64', 'name':'object', 'manager_id':'Int64', 'salary':'Int64'})

#Task
'''
Find the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. 
When a manager leaves the company, their information is deleted from the Employees table, 
but the reports still have their manager_id set to the manager that left.

Return the result table ordered by employee_id.

Columns - employee_id
'''

#Solution
employees[~(employees['manager_id'].isin(employees['employee_id'])) & (employees['salary'] < 30000)].dropna()[['employee_id']].sort_values('employee_id')

   employee_id
5           11

In [58]:
##626 - Exchange Seats

#DF
data = [[1, 'Abbot'], [2, 'Doris'], [3, 'Emerson'], [4, 'Green'], [5, 'Jeames']]
seat = pd.DataFrame(data, columns=['id', 'student']).astype({'id':'Int64', 'student':'object'})

#Task
'''
Write a solution to swap the seat id of every two consecutive students. 
If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.

Columns - id, student
'''

#Solution
seat['order id'] = (
    np.where(seat['id'] < seat['id'].max(), np.where(seat['id'] % 2 == 0, seat['id'] - 1, seat['id'] + 1), np.where(seat['id'] % 2 == 0, seat['id'] -1, seat['id']))
)

seat.sort_values('order id')[['order id','student']].rename(columns = {'order id' : 'id'})

   id  student
1   1    Doris
0   2    Abbot
3   3    Green
2   4  Emerson
4   5   Jeames

In [59]:
##1341 - Movie Rating

#DF
data = [[1, 'Avengers'], [2, 'Frozen 2'], [3, 'Joker']]
movies = pd.DataFrame(data, columns=['movie_id', 'title']).astype({'movie_id':'Int64', 'title':'object'})
data = [[1, 'Daniel'], [2, 'Monica'], [3, 'Maria'], [4, 'James']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})
data = [[1, 1, 3, '2020-01-12'], [1, 2, 4, '2020-02-11'], [1, 3, 2, '2020-02-12'], [1, 4, 1, '2020-01-01'], [2, 1, 5, '2020-02-17'], [2, 2, 2, '2020-02-01'], [2, 3, 2, '2020-03-01'], [3, 1, 3, '2020-02-22'], [3, 2, 4, '2020-02-25']]
movie_rating = pd.DataFrame(data, columns=['movie_id', 'user_id', 'rating', 'created_at']).astype({'movie_id':'Int64', 'user_id':'Int64', 'rating':'Int64', 'created_at':'datetime64[ns]'})

#Task
'''
Write a solution to:

Find the name of the user who has rated the greatest number of movies. In case of a tie, return the lexicographically smaller user name.
Find the movie name with the highest average rating in February 2020. In case of a tie, return the lexicographically smaller movie name.

Columns - results
'''

#alternate for time period
'''
Movies_df = Movies_df[Movies_df['created_at'].dt.to_period('M') == '2020-02']
'''

#Solution
data = movie_rating.merge(movies, on = 'movie_id', how = 'left').merge(users, on = 'user_id', how = 'left')
top_reviewer = data.groupby('name').size().reset_index(name = 'results').sort_values(['results','name'],ascending = [False, True])[['name']].head(1)
top_reviewer.columns = ['results'] 

data = data.loc[data['created_at'].between('2020-02-01','2020-02-29')]
top_movie = data.groupby('title')['rating'].mean().reset_index(name = 'results').sort_values(['results','title'], ascending = [False, True])[['title']].head(1)
top_movie.columns = ['results']

pd.concat([
    top_reviewer,top_movie])

    results
0    Daniel
1  Frozen 2

In [60]:
##1321 - Restaurant Growth

#DF
data = [[1, 'Jhon', '2019-01-01', 100], [2, 'Daniel', '2019-01-02', 110], [3, 'Jade', '2019-01-03', 120], [4, 'Khaled', '2019-01-04', 130], [5, 'Winston', '2019-01-05', 110], [6, 'Elvis', '2019-01-06', 140], [7, 'Anna', '2019-01-07', 150], [8, 'Maria', '2019-01-08', 80], [9, 'Jaze', '2019-01-09', 110], [1, 'Jhon', '2019-01-10', 130], [3, 'Jade', '2019-01-10', 150]]
customer = pd.DataFrame(data, columns=['customer_id', 'name', 'visited_on', 'amount']).astype({'customer_id':'Int64', 'name':'object', 'visited_on':'datetime64[ns]', 'amount':'Int64'})

#Task
'''
You are the restaurant owner and you want to analyze a possible expansion (there will be at least one customer every day).
Compute the moving average of how much the customer paid in a seven days window (i.e., current day + 6 days before). 
average_amount should be rounded to two decimal places.
Return the result table ordered by visited_on in ascending order.

Columns - visited_on, amount, average_amount
'''

#Solution
customer = customer.groupby('visited_on')['amount'].sum().reset_index(name = 'amount')
customer['average_amount'] = customer.amount.rolling(window = 7).mean().round(2)
customer['amount'] = customer.amount.rolling(window = 7).sum()
customer.dropna()

  visited_on  amount  average_amount
6 2019-01-07   860.0          122.86
7 2019-01-08   840.0          120.00
8 2019-01-09   840.0          120.00
9 2019-01-10  1000.0          142.86

In [61]:
##602 - Friend Request II: Who Has the Most Friends

#DF
data = [[1, 2, '2016/06/03'], [1, 3, '2016/06/08'], [2, 3, '2016/06/08'], [3, 4, '2016/06/09']]
request_accepted = pd.DataFrame(data, columns=['requester_id', 'accepter_id', 'accept_date']).astype({'requester_id':'Int64', 'accepter_id':'Int64', 'accept_date':'datetime64[ns]'})

#Task
'''
Write a solution to find the people who have the most friends and the most friends number.
The test cases are generated so that only one person has the most friends.

Columns - id, num
'''

#Solution
r = request_accepted
r = pd.concat([r.rename(columns = {'requester_id' : 'id'})[['id']],r.rename(columns = {'accepter_id' : 'id'})[['id']]])
r.groupby('id').size().reset_index(name = 'num').sort_values('num', ascending = False).head(1)

   id  num
2   3    3

In [62]:
##585 - Investments in 2016

#DF
data = [[1, 10, 5, 10, 10], [2, 20, 20, 20, 20], [3, 10, 30, 20, 20], [4, 10, 40, 40, 40]]
insurance = pd.DataFrame(data, columns=['pid', 'tiv_2015', 'tiv_2016', 'lat', 'lon']).astype({'pid':'Int64', 'tiv_2015':'Float64', 'tiv_2016':'Float64', 'lat':'Float64', 'lon':'Float64'})

#Task
'''
Write a solution to report the sum of all total investment values in 2016 tiv_2016, for all policyholders who:

have the same tiv_2015 value as one or more other policyholders, and
are not located in the same city as any other policyholder (i.e., the (lat, lon) attribute pairs must be unique).
Round tiv_2016 to two decimal places.

Columns - tiv_2016
'''

#Solution 1
'''
i = insurance

tiv15 = i.groupby('tiv_2015').size().reset_index(name = 'count')
loc = i.groupby(['lat','lon']).size().reset_index(name = 'loc')

i = i.merge(tiv15, on = 'tiv_2015', how = 'left').merge(loc, on = ['lat','lon'], how = 'left')
i = i[(i['count'] > 1) & (i['loc'] == 1)]
i = i['tiv_2016'].sum().round(2)
pd.DataFrame({'tiv_2016': [i]})
'''

#Solution 2
i = insurance
i['id_count'] = i.groupby('tiv_2015')['pid'].transform('count')
i['loc_count'] = i.groupby(['lat','lon'])['pid'].transform('count')

i = i[(i['id_count'] >1) & (i['loc_count'] == 1)]['tiv_2016'].sum().round(2)
pd.DataFrame({'tiv_2016' : [i]})

   tiv_2016
0      45.0

In [63]:
##185 - Department Top Three Salaries

#DF
data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

#Task
'''
A company's executives are interested in seeing who earns the most money in each of the company's departments. 
A high earner in a department is an employee who has a salary in the top three unique salaries for that department.
Write a solution to find the employees who are high earners in each of the departments.
Return the result table in any order.

Columns - Department, Employee, Salary
'''

#Solution
e = employee.merge(department, left_on = 'departmentId', right_on = 'id', how = 'left').rename(columns = {'name_x' : 'employee','name_y' : 'department'})
e['rank'] = e.groupby('department')['salary'].rank(method = 'dense', ascending = False)
e.query('rank < 4').sort_values(['department','rank'], ascending = [True, True])[['department','employee','salary']]

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\2249486733.py:22: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  e.query('rank < 4').sort_values(['department','rank'], ascending = [True, True])[['department','employee','salary']]

  department employee  salary
3         IT      Max   90000
0         IT      Joe   85000
5         IT    Randy   85000
6         IT     Will   70000
1      Sales    Henry   80000
2      Sales      Sam   60000

In [64]:
##1327 - List the Products Ordered in a Period

#DF
data = [[1, 'Leetcode Solutions', 'Book'], [2, 'Jewels of Stringology', 'Book'], [3, 'HP', 'Laptop'], [4, 'Lenovo', 'Laptop'], [5, 'Leetcode Kit', 'T-shirt']]
products = pd.DataFrame(data, columns=['product_id', 'product_name', 'product_category']).astype({'product_id':'Int64', 'product_name':'object', 'product_category':'object'})
data = [[1, '2020-02-05', 60], [1, '2020-02-10', 70], [2, '2020-01-18', 30], [2, '2020-02-11', 80], [3, '2020-02-17', 2], [3, '2020-02-24', 3], [4, '2020-03-01', 20], [4, '2020-03-04', 30], [4, '2020-03-04', 60], [5, '2020-02-25', 50], [5, '2020-02-27', 50], [5, '2020-03-01', 50]]
orders = pd.DataFrame(data, columns=['product_id', 'order_date', 'unit']).astype({'product_id':'Int64', 'order_date':'datetime64[ns]', 'unit':'Int64'})

#Task
'''
Write a solution to get the names of products that have at least 100 units ordered in February 2020 and their amount.
Return the result table in any order.

Columns - product_name, unit
'''

#Solution
orders = orders[orders['order_date'].dt.to_period('M') == '2020-02']
orders.merge(products, on = 'product_id', how = 'left').groupby('product_name')['unit'].sum().reset_index(name = 'unit').query('unit >= 100').sort_values('unit', ascending = False)

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\2856257033.py:19: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  orders.merge(products, on = 'product_id', how = 'left').groupby('product_name')['unit'].sum().reset_index(name = 'unit').query('unit >= 100').sort_values('unit', ascending = False)

         product_name  unit
3  Leetcode Solutions   130
2        Leetcode Kit   100

In [65]:
##1084 - Sales Analysis III

#DF
data = [[1, 'S8', 1000], [2, 'G4', 800], [3, 'iPhone', 1400]]
product = pd.DataFrame(data, columns=['product_id', 'product_name', 'unit_price']).astype({'product_id':'Int64', 'product_name':'object', 'unit_price':'Int64'})
data = [[1, 1, 1, '2019-01-21', 2, 2000], [1, 2, 2, '2019-02-17', 1, 800], [2, 2, 3, '2019-06-02', 1, 800], [3, 3, 4, '2019-05-13', 2, 2800]]
sales = pd.DataFrame(data, columns=['seller_id', 'product_id', 'buyer_id', 'sale_date', 'quantity', 'price']).astype({'seller_id':'Int64', 'product_id':'Int64', 'buyer_id':'Int64', 'sale_date':'datetime64[ns]', 'quantity':'Int64', 'price':'Int64'})

#Task
'''
Write a solution to report the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.
Return the result table in any order.

Columns - product_id, product_name
'''

#Solution
s = sales[sales['sale_date'].dt.to_period('Q') != '2019Q1']['product_id']
sales[~sales['product_id'].isin(s)].merge(product, on = 'product_id', how = 'left')[['product_id','product_name']].drop_duplicates('product_id')

   product_id product_name
0           1           S8

In [66]:
##1158 - Market Analysis I

#DF
data = [[1, '2018-01-01', 'Lenovo'], [2, '2018-02-09', 'Samsung'], [3, '2018-01-19', 'LG'], [4, '2018-05-21', 'HP']]
users = pd.DataFrame(data, columns=['user_id', 'join_date', 'favorite_brand']).astype({'user_id':'Int64', 'join_date':'datetime64[ns]', 'favorite_brand':'object'})
data = [[1, '2019-08-01', 4, 1, 2], [2, '2018-08-02', 2, 1, 3], [3, '2019-08-03', 3, 2, 3], [4, '2018-08-04', 1, 4, 2], [5, '2018-08-04', 1, 3, 4], [6, '2019-08-05', 2, 2, 4]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'item_id', 'buyer_id', 'seller_id']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'item_id':'Int64', 'buyer_id':'Int64', 'seller_id':'Int64'})
data = [[1, 'Samsung'], [2, 'Lenovo'], [3, 'LG'], [4, 'HP']]
items = pd.DataFrame(data, columns=['item_id', 'item_brand']).astype({'item_id':'Int64', 'item_brand':'object'})

#Task 
'''
Write a solution to find for each user, the join date and the number of orders they made as a buyer in 2019.

Columns - buyer_id, join_date, orders_in_2019
'''

#Solution
data = users.merge(orders, left_on = 'user_id', right_on = 'buyer_id', how = 'left')
data['2019'] = np.where(data['order_date'].dt.to_period('Y') == '2019',1,0)
data.groupby(['user_id','join_date'])['2019'].sum().reset_index(name = 'orders_in_2019').rename(columns = {'user_id' : 'buyer_id'})

   buyer_id  join_date  orders_in_2019
0         1 2018-01-01               1
1         2 2018-02-09               2
2         3 2018-01-19               0
3         4 2018-05-21               0

In [67]:
##1890 - The Latest Login in 2020

#DF
data = [[6, '2020-06-30 15:06:07'], [6, '2021-04-21 14:06:06'], [6, '2019-03-07 00:18:15'], [8, '2020-02-01 05:10:53'], [8, '2020-12-30 00:46:50'], [2, '2020-01-16 02:49:50'], [2, '2019-08-25 07:59:08'], [14, '2019-07-14 09:00:00'], [14, '2021-01-06 11:59:59']]
logins = pd.DataFrame(data, columns=['user_id', 'time_stamp']).astype({'user_id':'Int64', 'time_stamp':'datetime64[ns]'})

#Task
'''
Write a solution to report the latest login for all users in the year 2020. Do not include the users who did not login in 2020.

Columns - user_id, last_stamp
'''

#Solution

logins[logins['time_stamp'].dt.to_period('Y') == '2020'].groupby('user_id')['time_stamp'].max().reset_index(name = 'last_stamp')

   user_id          last_stamp
0        2 2020-01-16 02:49:50
1        6 2020-06-30 15:06:07
2        8 2020-12-30 00:46:50

In [68]:
##1407 - Top Travellers

#DF
data = [[1, 'Alice'], [2, 'Bob'], [3, 'Alex'], [4, 'Donald'], [7, 'Lee'], [13, 'Jonathan'], [19, 'Elvis']]
users = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 1, 120], [2, 2, 317], [3, 3, 222], [4, 7, 100], [5, 13, 312], [6, 19, 50], [7, 7, 120], [8, 19, 400], [9, 7, 230]]
rides = pd.DataFrame(data, columns=['id', 'user_id', 'distance']).astype({'id':'Int64', 'user_id':'Int64', 'distance':'Int64'})

#Task
'''
Write a solution to report the distance traveled by each user.

Return the result table ordered by travelled_distance in descending order, 
if two or more users traveled the same distance, order them by their name in ascending order.

Columns - name, travelled_distance
'''

#Solution
r = rides.groupby('user_id')['distance'].sum().reset_index(name = 'travelled_distance')
users.merge(r,left_on = 'id', right_on = 'user_id',how = 'left').fillna(0)[['name','travelled_distance']].sort_values(['travelled_distance','name'], ascending = [False, True])

       name  travelled_distance
6     Elvis                 450
4       Lee                 450
1       Bob                 317
5  Jonathan                 312
2      Alex                 222
0     Alice                 120
3    Donald                   0

In [69]:
##1587 - Bank Account Summary II

#DF
data = [[900001, 'Alice'], [900002, 'Bob'], [900003, 'Charlie']]
users = pd.DataFrame(data, columns=['account', 'name']).astype({'account':'Int64', 'name':'object'})
data = [[1, 900001, 7000, '2020-08-01'], [2, 900001, 7000, '2020-09-01'], [3, 900001, -3000, '2020-09-02'], [4, 900002, 1000, '2020-09-12'], [5, 900003, 6000, '2020-08-07'], [6, 900003, 6000, '2020-09-07'], [7, 900003, -4000, '2020-09-11']]
transactions = pd.DataFrame(data, columns=['trans_id', 'account', 'amount', 'transacted_on']).astype({'trans_id':'Int64', 'account':'Int64', 'amount':'Int64', 'transacted_on':'datetime64[ns]'})

#Task
'''
Write a solution to report the name and balance of users with a balance higher than 10000. 
The balance of an account is equal to the sum of the amounts of all transactions involving that account.

columns - name, balance
'''

#Solution
t = transactions.groupby('account')['amount'].sum().reset_index(name = 'balance')
users.merge(t, on = 'account', how = 'left').query('balance > 10000')[['name','balance']]

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\4044390275.py:19: RuntimeWarning: Engine has switched to 'python' because numexpr does not support extension array dtypes. Please set your engine to python manually.
  users.merge(t, on = 'account', how = 'left').query('balance > 10000')[['name','balance']]

    name  balance
0  Alice    11000

In [70]:
##1393 - Capital Gain/Loss

#DF
data = [['Leetcode', 'Buy', 1, 1000], ['Corona Masks', 'Buy', 2, 10], ['Leetcode', 'Sell', 5, 9000], ['Handbags', 'Buy', 17, 30000], ['Corona Masks', 'Sell', 3, 1010], ['Corona Masks', 'Buy', 4, 1000], ['Corona Masks', 'Sell', 5, 500], ['Corona Masks', 'Buy', 6, 1000], ['Handbags', 'Sell', 29, 7000], ['Corona Masks', 'Sell', 10, 10000]]
stocks = pd.DataFrame(data, columns=['stock_name', 'operation', 'operation_day', 'price']).astype({'stock_name':'object', 'operation':'object', 'operation_day':'Int64', 'price':'Int64'})

#Task
'''
Write a solution to report the Capital gain/loss for each stock.
The Capital gain/loss of a stock is the total gain or loss after buying and selling the stock one or many times.

Columns - stock_name, capital_gain_loss
'''

#Solution
stocks['transaction'] = np.where(stocks['operation'] == 'Buy', stocks['price']*-1, stocks['price'])
stocks.groupby('stock_name')['transaction'].sum().reset_index(name = 'capital_gain_loss')

     stock_name  capital_gain_loss
0  Corona Masks               9500
1      Handbags             -23000
2      Leetcode               8000

In [71]:
##3436 - Find Valid Emails

#DF
data = [[1, 'alice@example.com'], [2, 'bob_at_example.com'], [3, 'charlie@example.net'], [4, 'david@domain.com'], [5, 'eve@invalid']]
users = pd.DataFrame(data, columns=["user_id", "email"]).astype({"user_id": "int32", "email": "string"})

#Task
'''
Write a solution to find all the valid email addresses. A valid email address meets the following criteria:

It contains exactly one @ symbol.
It ends with .com.
The part before the @ symbol contains only alphanumeric characters and underscores.
The part after the @ symbol and before .com contains a domain name that contains only letters.
Return the result table ordered by user_id in ascending order.

Columns - user_id, email
'''

pattern = r'^[A-Za-z0-9_]+@[A-Za-z]+\.com$'

users[users['email'].str.fullmatch(pattern)].sort_values("user_id").reset_index(drop=True)

   user_id              email
0        1  alice@example.com
1        4   david@domain.com

In [72]:
##3564 - Seasonal Sales Analysis

#DF
data = [[1, 1, '2023-01-15', 5, 10.0], [2, 2, '2023-01-20', 4, 15.0], [3, 3, '2023-03-10', 3, 18.0], [4, 4, '2023-04-05', 1, 20.0], [5, 1, '2023-05-20', 2, 10.0], [6, 2, '2023-06-12', 4, 15.0], [7, 5, '2023-06-15', 5, 12.0], [8, 3, '2023-07-24', 2, 18.0], [9, 4, '2023-08-01', 5, 20.0], [10, 5, '2023-09-03', 3, 12.0], [11, 1, '2023-09-25', 6, 10.0], [12, 2, '2023-11-10', 4, 15.0], [13, 3, '2023-12-05', 6, 18.0], [14, 4, '2023-12-22', 3, 20.0], [15, 5, '2024-02-14', 2, 12.0]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'sale_date', 'quantity', 'price']).astype({'sale_id': 'int64', 'product_id': 'int64', 'sale_date': 'datetime64[ns]', 'quantity': 'int64', 'price': 'float64'})

data = [[1, 'Warm Jacket', 'Apparel'], [2, 'Designer Jeans', 'Apparel'], [3, 'Cutting Board', 'Kitchen'], [4, 'Smart Speaker', 'Tech'], [5, 'Yoga Mat', 'Fitness']]
products = pd.DataFrame(data, columns=['product_id', 'product_name', 'category']).astype({'product_id': 'int64', 'product_name': 'string', 'category': 'string'})

#Task
'''
Write a solution to find the most popular product category for each season. The seasons are defined as:

Winter: December, January, February
Spring: March, April, May
Summer: June, July, August
Fall: September, October, November
The popularity of a category is determined by the total quantity sold in that season. If there is a tie, select the category with the highest total revenue (quantity  price).

Return the result table ordered by season in ascending order.

Columns - season, category, total quantity, total revenue
'''

#Solution
sales = sales.merge(products, on = 'product_id', how = 'left')
sales['season'] = np.select(
    [
        sales['sale_date'].dt.month.isin([12,1,2]),
        sales['sale_date'].dt.month.isin([3,4,5]),
        sales['sale_date'].dt.month.isin([6,7,8]),
        sales['sale_date'].dt.month.isin([9,10,11])
    ],
    ['Winter','Spring','Summer','Fall']
)

sales['revenue'] = sales['quantity'] * sales['price']
sales = sales.groupby(['season','category']).agg(
    total_quantity = ('quantity','sum'),
    total_revenue = ('revenue','sum')).reset_index()
sales.sort_values(['total_quantity','total_revenue'],ascending = [False,False]).drop_duplicates('season').sort_values('season', ascending = True)

   season category  total_quantity  total_revenue
0    Fall  Apparel              10          120.0
3  Spring  Kitchen               3           54.0
8  Summer     Tech               5          100.0
9  Winter  Apparel               9          110.0

In [73]:
##601 - Human Traffic of Stadium

#DF
data = [[1, '2017-01-01', 10], [2, '2017-01-02', 109], [3, '2017-01-03', 150], [4, '2017-01-04', 99], [5, '2017-01-05', 145], [6, '2017-01-06', 1455], [7, '2017-01-07', 199], [8, '2017-01-09', 188]]
stadium = pd.DataFrame(data, columns=['id', 'visit_date', 'people']).astype({'id':'Int64', 'visit_date':'datetime64[ns]', 'people':'Int64'})

#Task
'''
Write a solution to display the records with three or more rows with consecutive id's, 
and the number of people is greater than or equal to 100 for each.
Return the result table ordered by visit_date in ascending order.

Columns - id, visit_date, people
'''

#Solution
stadium['prev day people'] = stadium['people'].shift(1)
stadium['prev two day people'] = stadium['people'].shift(2)
stadium['next day people'] = stadium['people'].shift(-1)
stadium['next two day people'] = stadium['people'].shift(-2)

stadium[
    ((stadium['people'] > 99) & (stadium['prev day people'] > 99) & (stadium['prev two day people'] > 99)) |
    ((stadium['people'] > 99) & (stadium['next day people'] > 99) & (stadium['next two day people'] > 99)) |
    ((stadium['people'] > 99) & (stadium['next day people'] > 99) & (stadium['prev day people'] > 99))][['id','visit_date','people']]

#Solution 2
id_100 = stadium['people']>99
cons = id_100.rolling(3,min_periods = 3).sum()==3

cons_t = cons | cons.shift(-1) | cons.shift(-2)
stadium.loc[cons_t, ['id','visit_date','people']]

   id visit_date  people
4   5 2017-01-05     145
5   6 2017-01-06    1455
6   7 2017-01-07     199
7   8 2017-01-09     188

In [74]:
##608 - Tree Node

#DF
data = [[1, None], [2, 1], [3, 1], [4, 2], [5, 2]]
tree = pd.DataFrame(data, columns=['id', 'p_id']).astype({'id':'Int64', 'p_id':'Int64'})

#Task
'''
Each node in the tree can be one of three types:

"Leaf": if the node is a leaf node.
"Root": if the node is the root of the tree.
"Inner": If the node is neither a leaf node nor a root node.
Write a solution to report the type of each node in the tree.

columns - id, type
'''

#Solution
tree['type'] = np.where(tree['p_id'].isnull(),"Root",np.where(tree['id'].isin(tree['p_id']),"Inner","Leaf"))
tree[['id','type']]

   id   type
0   1   Root
1   2  Inner
2   3   Leaf
3   4   Leaf
4   5   Leaf

In [75]:
##3793 - Find Users with High Token Usage

#DF
data = [[1, 'Write a blog outline', 120], [1, 'Generate SQL query', 80], [1, 'Summarize an article', 200], [2, 'Create resume bullet', 60], [2, 'Improve LinkedIn bio', 70], [3, 'Explain neural networks', 300], [3, 'Generate interview Q&A', 250], [3, 'Write cover letter', 180], [3, 'Optimize Python code', 220]]
prompts = pd.DataFrame(data, columns= ['user_id','prompt','tokens'])

#Task
'''
Write a solution to analyze AI prompt usage patterns based on the following requirements:

For each user, calculate the total number of prompts they have submitted.
For each user, calculate the average tokens used per prompt (Rounded to 2 decimal places).
Only include users who have submitted at least 3 prompts.
Only include users who have submitted at least one prompt with tokens greater than their own average token usage.
Return the result table ordered by average tokens in descending order, and then by user_id in ascending order.

columns - user_id, prompt_count, avg_tokens
'''

x = prompts.groupby('user_id').agg(
    prompt_count = ('user_id','size'),
    avg_tokens = ('tokens',lambda x : x.mean().round(2)),
    max_tokens = ('tokens', 'max')).reset_index()

x[(x['prompt_count']>2)&(x['max_tokens']>x['avg_tokens'])][['user_id','prompt_count','avg_tokens']].sort_values(['avg_tokens','user_id'], ascending = [False, True])

   user_id  prompt_count  avg_tokens
2        3             4      237.50
0        1             3      133.33

In [76]:
##3570 - Find Books with No Available Copies

#DF
data = [[1, 'The Great Gatsby', 'F. Scott', 'Fiction', 1925, 3], [2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 3], [3, '1984', 'George Orwell', 'Dystopian', 1949, 1], [4, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 2], [5, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 1], [6, 'Brave New World', 'Aldous Huxley', 'Dystopian', 1932, 4]]
library_books = pd.DataFrame(data, columns = ['book_id','title','author','genre','publication_year','total_copies'])

data = [[1, 1, 'Alice Smith', '2024-01-15', None], [2, 1, 'Bob Johnson', '2024-01-20', None], [3, 2, 'Carol White', '2024-01-10', '2024-01-25'], [4, 3, 'David Brown', '2024-02-01', None], [5, 4, 'Emma Wilson', '2024-01-05', None], [6, 5, 'Frank Davis', '2024-01-18', '2024-02-10'], [7, 1, 'Grace Miller', '2024-02-05', None], [8, 6, 'Henry Taylor', '2024-01-12', None], [9, 2, 'Ivan Clark', '2024-02-12', None], [10, 2, 'Jane Adams', '2024-02-15', None]]
borrowing_records = pd.DataFrame(data, columns = ['record_id','book_id','borrower_name','borrow_date','return_date'])

#Task
'''
Write a solution to find all books that are currently borrowed (not returned) and have zero copies available in the library.

A book is considered currently borrowed if there exists a borrowing record with a NULL return_date
Return the result table ordered by current borrowers in descending order, then by book title in ascending order.

columns -  book_id, title, author, genre, publication_year, current_borrowers 
'''

#Solution
b = borrowing_records[borrowing_records['return_date'].isnull()].groupby('book_id').size().reset_index(name = "borrowed")
l = library_books.merge(b, on = 'book_id',how = 'left')
l[l['total_copies'] == l['borrowed']].rename(columns = {'borrowed' : 'current_borrowers'})[['book_id','title','author','genre','publication_year','current_borrowers']].sort_values(['current_borrowers','title'],ascending = [False,True])

,book_id,title,author,genre,publication_year,current_borrowers
0,1,The Great Gatsby,F. Scott,Fiction,1925,3.0
2,3,1984,George Orwell,Dystopian,1949,1.0

In [77]:
##3465 - Find Product with Valid Serial Numbers

#DF
data = [[1, 'Widget A', 'This is a sample product with SN1234-5678'], [2, 'Widget B', 'A product with serial SN9876-1234 in the description'], [3, 'Widget C', 'Product SN1234-56789 is available now'], [4, 'Widget D', 'No serial number here'], [5, 'Widget E', 'Check out SN4321-8765 in this description']]
products = pd.DataFrame(data, columns=['product_id', 'product_name', 'description']).astype({'product_id': 'int32', 'product_name': 'string', 'description': 'string'})

#Task
'''
Write a solution to find all products whose description contains a valid serial number pattern. A valid serial number follows these rules:

It starts with the letters SN (case-sensitive).
Followed by exactly 4 digits.
It must have a hyphen (-) followed by exactly 4 digits.
The serial number must be within the description (it may not necessarily start at the beginning).
Return the result table ordered by product_id in ascending order.

columns - product_id, product_name, description
'''

#Solution
pattern = r"\bSN\d{4}-\d{4}\b"
products[products['description'].str.contains(pattern, regex = True)]

   product_id product_name                                        description
0           1     Widget A          This is a sample product with SN1234-5678
1           2     Widget B  A product with serial SN9876-1234 in the descr...
4           5     Widget E          Check out SN4321-8765 in this description

In [78]:
##3220 - Odd and Even Transactions

#DF
data = [[1, 150, '2024-07-01'], [2, 200, '2024-07-01'], [3, 75, '2024-07-01'], [4, 300, '2024-07-02'], [5, 50, '2024-07-02'], [6, 120, '2024-07-03']]
transactions = pd.DataFrame(data, columns=["transaction_id", "amount", "transaction_date"])

#Task
'''
Write a solution to find the sum of amounts for odd and even transactions for each day. 
If there are no odd or even transactions for a specific date, display as 0.
Return the result table ordered by transaction_date in ascending order.

columns - transaction_date, odd_sum, even_sum
'''

#Solution
transactions.groupby('transaction_date').agg(
    odd_sum = ('amount', lambda x : (np.where(x % 2 != 0,x,0)).sum()),
    even_sum = ('amount', lambda x : (np.where(x % 2 == 0,x,0)).sum())).reset_index().sort_values('transaction_date')

  transaction_date  odd_sum  even_sum
0       2024-07-01       75       350
1       2024-07-02        0       350
2       2024-07-03        0       120

In [79]:
##3421 - Find Students Who Improved 

#DF
data = [[101, 'Math', 70, '2023-01-15'], [101, 'Math', 85, '2023-02-15'], [101, 'Physics', 65, '2023-01-15'], [101, 'Physics', 60, '2023-02-15'], [102, 'Math', 80, '2023-01-15'], [102, 'Math', 85, '2023-02-15'], [103, 'Math', 90, '2023-01-15'], [104, 'Physics', 75, '2023-01-15'], [104, 'Physics', 85, '2023-02-15']]
scores = pd.DataFrame(data, columns = ['student_id','subject','score','exam_date'])

#Task
'''
Write a solution to find the students who have shown improvement. A student is considered to have shown improvement if they meet both of these conditions:

Have taken exams in the same subject on at least two different dates
Their latest score in that subject is higher than their first score
Return the result table ordered by student_id, subject in ascending order.

columns - student_id, subject, first_score, latest_score
'''

#Solution 
s = scores.sort_values(['student_id','subject','exam_date'])
s.groupby(['student_id','subject']).agg(
    first_score = ('score','first'),
    latest_score = ('score','last')).reset_index().query('first_score < latest_score')

   student_id  subject  first_score  latest_score
0         101     Math           70            85
2         102     Math           80            85
4         104  Physics           75            85

In [80]:
##3475 - DNA Pattern Recognition

#DF
data = [[1, 'ATGCTAGCTAGCTAA', 'Human'], [2, 'GGGTCAATCATC', 'Human'], [3, 'ATATATCGTAGCTA', 'Human'], [4, 'ATGGGGTCATCATAA', 'Mouse'], [5, 'TCAGTCAGTCAG', 'Mouse'], [6, 'ATATCGCGCTAG', 'Zebrafish'], [7, 'CGTATGCGTCGTA', 'Zebrafish']]
samples = pd.DataFrame(data, columns = ['sample_id','dna_sequence','species'])

#Task
'''
Biologists are studying basic patterns in DNA sequences. Write a solution to identify sample_id with the following patterns:

Sequences that start with ATG (a common start codon)
Sequences that end with either TAA, TAG, or TGA (stop codons)
Sequences containing the motif ATAT (a simple repeated pattern)
Sequences that have at least 3 consecutive G (like GGG or GGGG)
Return the result table ordered by sample_id in ascending order.

columns - sample_id, dna_sequence, species, has_start, has_stop, has_atat, has_ggg
'''

#Solution
samples['has_start'] = samples['dna_sequence'].str.contains(r'^ATG', regex = True)*1
samples['has_stop'] = samples['dna_sequence'].str.contains(r'(TAA|TAG|TGA)$',regex = True)*1
samples['has_atat'] = samples['dna_sequence'].str.contains(r'ATAT',regex = True)*1
samples['has_ggg'] = samples['dna_sequence'].str.contains(r'GGG',regex = True)*1

samples

C:\Users\JT-Cargo\AppData\Local\Temp\ipykernel_26972\518024704.py:22: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  samples['has_stop'] = samples['dna_sequence'].str.contains(r'(TAA|TAG|TGA)$',regex = True)*1

,sample_id,dna_sequence,species,has_start,has_stop,has_atat,has_ggg
0,1,ATGCTAGCTAGCTAA,Human,1,1,0,0
1,2,GGGTCAATCATC,Human,0,0,0,1
2,3,ATATATCGTAGCTA,Human,0,0,1,0
3,4,ATGGGGTCATCATAA,Mouse,1,1,0,1
4,5,TCAGTCAGTCAG,Mouse,0,0,0,0
5,6,ATATCGCGCTAG,Zebrafish,0,1,1,0
6,7,CGTATGCGTCGTA,Zebrafish,0,0,0,0

In [81]:
##3497 - Analyze Subscription Convertion

#DF
data = [[1, '2023-01-01', 'free_trial', 45], [1, '2023-01-02', 'free_trial', 30], [1, '2023-01-05', 'free_trial', 60], [1, '2023-01-10', 'paid', 75], [1, '2023-01-12', 'paid', 90], [1, '2023-01-15', 'paid', 65], [2, '2023-02-01', 'free_trial', 55], [2, '2023-02-03', 'free_trial', 25], [2, '2023-02-07', 'free_trial', 50], [2, '2023-02-10', 'cancelled', 0], [3, '2023-03-05', 'free_trial', 70], [3, '2023-03-06', 'free_trial', 60], [3, '2023-03-08', 'free_trial', 80], [3, '2023-03-12', 'paid', 50], [3, '2023-03-15', 'paid', 55], [3, '2023-03-20', 'paid', 85], [4, '2023-04-01', 'free_trial', 40], [4, '2023-04-03', 'free_trial', 35], [4, '2023-04-05', 'paid', 45], [4, '2023-04-07', 'cancelled', 0]]
user_activity = pd.DataFrame(data, columns = ['user_id','activity_date','activity_type','activity_duration'])

#Task
'''
A subscription service wants to analyze user behavior patterns. The company offers a 7-day free trial, after which users can subscribe to a paid plan or cancel. Write a solution to:

Find users who converted from free trial to paid subscription
Calculate each user's average daily activity duration during their free trial period (rounded to 2 decimal places)
Calculate each user's average daily activity duration during their paid subscription period (rounded to 2 decimal places)
Return the result table ordered by user_id in ascending order.

columns - user_id, trial_avg_duration, paid_avg_duration
'''

#Solution
round2 = lambda x: round(x + 1e-9,2)
u = user_activity
paid = u[u['activity_type'] == 'paid']['user_id']

u = u[u['user_id'].isin(paid)]
u = u[u['activity_type']!= 'cancelled'].groupby(['user_id','activity_type'])['activity_duration'].mean().apply(round2).reset_index(name = 'duration')
u = u.pivot(index = 'user_id', columns = 'activity_type', values = 'duration').rename_axis(None, axis = 1).reset_index()
u.rename(columns = {'free_trial':'trial_avg_duration','paid':'paid_avg_duration'}).sort_values('user_id')

   user_id  trial_avg_duration  paid_avg_duration
0        1                45.0              76.67
1        3                70.0              63.33
2        4                37.5              45.00

In [82]:
##3521 - Find Product Recommendation Pairs

#DF
data = [[1, 101, 2], [1, 102, 1], [1, 103, 3], [2, 101, 1], [2, 102, 5], [2, 104, 1], [3, 101, 2], [3, 103, 1], [3, 105, 4], [4, 101, 1], [4, 102, 1], [4, 103, 2], [4, 104, 3], [5, 102, 2], [5, 104, 1]]
product_purchases = pd.DataFrame(data, columns = ['user_id','product_id','quantity'])

data = [[101, 'Electronics', 100], [102, 'Books', 20], [103, 'Clothing', 35], [104, 'Kitchen', 50], [105, 'Sports', 75]]
product_info= pd.DataFrame(data, columns = ['product_id','category','price'])

#Task
'''
Amazon wants to implement the Customers who bought this also bought... feature based on co-purchase patterns. Write a solution to :

Identify distinct product pairs frequently purchased together by the same customers (where product1_id < product2_id)
For each product pair, determine how many customers purchased both products
A product pair is considered for recommendation if at least 3 different customers have purchased both products.

Return the result table ordered by customer_count in descending order, and in case of a tie, 
by product1_id in ascending order, and then by product2_id in ascending order.

columns - product1_id, product2_id, product1_category, product2_category, customer_count
'''

#Solution

p = product_purchases.merge(product_purchases, on = 'user_id',how = 'inner', suffixes = ('1','2')).query('product_id1<product_id2')
p = p.groupby(['product_id1','product_id2']).size().reset_index(name = 'customer_count')
p = p.merge(product_info[['product_id','category']], left_on = 'product_id1', right_on = 'product_id', how = 'left')
p = p.merge(product_info[['product_id','category']], left_on = 'product_id2', right_on = 'product_id', how = 'left') 

p.rename(columns = {
    'product_id1' : 'product1_id',
    'product_id2' : 'product2_id',
    'category_x' : 'product1_category',
    'category_y' : 'product2_category'},inplace = True)

#ascending criteria could be replace by 0 and 1
p.iloc[:,[0,1,4,6,2]].query('customer_count>2').sort_values(['customer_count','product1_id','product2_id'],ascending = [False, True, True])

,product1_id,product2_id,product1_category,product2_category,customer_count
0,101,102,Electronics,Books,3
1,101,103,Electronics,Clothing,3
5,102,104,Books,Kitchen,3

In [83]:
##3580 - Find Consistently Improving Employees

#DF
data = [[1, 'Alice Johnson'], [2, 'Bob Smith'], [3, 'Carol Davis'], [4, 'David Wilson'], [5, 'Emma Brown']]
employees = pd.DataFrame(data, columns = ['employee_id','name'])

data = [[1, 1, '2023-01-15', 2], [2, 1, '2023-04-15', 3], [3, 1, '2023-07-15', 4], [4, 1, '2023-10-15', 5], [5, 2, '2023-02-01', 3], [6, 2, '2023-05-01', 2], [7, 2, '2023-08-01', 4], [8, 2, '2023-11-01', 5], [9, 3, '2023-03-10', 1], [10, 3, '2023-06-10', 2], [11, 3, '2023-09-10', 3], [12, 3, '2023-12-10', 4], [13, 4, '2023-01-20', 4], [14, 4, '2023-04-20', 4], [15, 4, '2023-07-20', 4], [16, 5, '2023-02-15', 3], [17, 5, '2023-05-15', 2]]
performance_reviews = pd.DataFrame(data, columns = ['review_id','employee_id','review_date','rating'])

#Task
'''
Write a solution to find employees who have consistently improved their performance over their last three reviews.

An employee must have at least 3 review to be considered
The employee's last 3 reviews must show strictly increasing ratings (each review better than the previous)
Use the most recent 3 reviews based on review_date for each employee
Calculate the improvement score as the difference between the latest rating and the earliest rating among the last 3 reviews
Return the result table ordered by improvement score in descending order, then by name in ascending order.

columns - employee_id, name, improvement_score
'''

#Solution
pr = performance_reviews

pr['rank'] = pr.groupby('employee_id')['review_date'].rank(ascending = 0)
pr = pr.query('rank<=3')
pr = pr.pivot(index = 'employee_id', columns = 'rank', values = 'rating').rename_axis(None, axis = 1).reset_index().dropna()
pr = pr[(pr[1] > pr[2])&(pr[2]>pr[3])]
pr['improvement_score'] = pr[1] - pr[3]
pr.merge(employees, on = 'employee_id', how = 'left')[['employee_id','name','improvement_score']].sort_values(['improvement_score','name'],ascending = [0,1])

   employee_id           name  improvement_score
1            2      Bob Smith                3.0
0            1  Alice Johnson                2.0
2            3    Carol Davis                2.0

In [84]:
##3586 - Find Covid Recovery Patients

#DF
data = [[1, 'Alice Smith', 28], [2, 'Bob Johnson', 35], [3, 'Carol Davis', 42], [4, 'David Wilson', 31], [5, 'Emma Brown', 29]]
patients = pd.DataFrame(data, columns = ['patient_id','patient_name','age'])

data = [[1, 1, '2023-01-15', 'Positive'], [2, 1, '2023-01-25', 'Negative'], [3, 2, '2023-02-01', 'Positive'], [4, 2, '2023-02-05', 'Inconclusive'], [5, 2, '2023-02-12', 'Negative'], [6, 3, '2023-01-20', 'Negative'], [7, 3, '2023-02-10', 'Positive'], [8, 3, '2023-02-20', 'Negative'], [9, 4, '2023-01-10', 'Positive'], [10, 4, '2023-01-18', 'Positive'], [11, 5, '2023-02-15', 'Negative'], [12, 5, '2023-02-20', 'Negative']]
covid_tests = pd.DataFrame(data, columns = ['test_id','patient_id','test_date','result'])

#Task
'''
Write a solution to find patients who have recovered from COVID - patients who tested positive but later tested negative.

A patient is considered recovered if they have at least one Positive test followed by at least one Negative test on a later date
Calculate the recovery time in days as the difference between the first positive test and the first negative test after that positive test
Only include patients who have both positive and negative test results
Return the result table ordered by recovery_time in ascending order, then by patient_name in ascending order.

columns -  patient_id, patient_name, age, recovery_time
'''

#Solution
c = covid_tests
c.sort_values(['patient_id','test_date'],ascending = [1,1])
c['test_date'] = c['test_date'].astype('datetime64[ns]')

pos = c[c['result']=='Positive'].groupby('patient_id').head(1)
neg = c[c['result']=='Negative']

d = pos.merge(neg, how = 'cross', suffixes = ("",2)).query('patient_id == patient_id2 and test_date < test_date2')
d['recovery_time'] = (d['test_date2'] - d['test_date'])
d.merge(patients, on = 'patient_id', how = 'left')[['patient_id','patient_name','age','recovery_time']].sort_values(['recovery_time','patient_name'],ascending = [1,1]).drop_duplicates('patient_id')

   patient_id patient_name  age recovery_time
0           1  Alice Smith   28       10 days
2           3  Carol Davis   42       10 days
1           2  Bob Johnson   35       11 days

In [85]:
##3601 - Find Drivers with Improved Fuel Efficiency

#DF
data = [[1, 'Alice Johnson'], [2, 'Bob Smith'], [3, 'Carol Davis'], [4, 'David Wilson'], [5, 'Emma Brown']]
drivers = pd.DataFrame(data, columns = ['driver_id','driver_name'])

data = [[1, 1, '2023-02-15', 120.5, 10.2], [2, 1, '2023-03-20', 200.0, 16.5], [3, 1, '2023-08-10', 150.0, 11.0], [4, 1, '2023-09-25', 180.0, 12.5], [5, 2, '2023-01-10', 100.0, 9.0], [6, 2, '2023-04-15', 250.0, 22.0], [7, 2, '2023-10-05', 200.0, 15.0], [8, 3, '2023-03-12', 80.0, 8.5], [9, 3, '2023-05-18', 90.0, 9.2], [10, 4, '2023-07-22', 160.0, 12.8], [11, 4, '2023-11-30', 140.0, 11.0], [12, 5, '2023-02-28', 110.0, 11.5]]
trips = pd.DataFrame(data, columns = ['trip_id','driver_id','trip_date','distance_km','fuel_consumed']).astype({'trip_date' : 'datetime64[ns]'})

#Task
'''
Write a solution to find drivers whose fuel efficiency has improved by comparing their average fuel efficiency in the first half of the year with the 
second half of the year.

Calculate fuel efficiency as distance_km / fuel_consumed for each trip
First half: January to June, Second half: July to December
Only include drivers who have trips in both halves of the year
Calculate the efficiency improvement as (second_half_avg - first_half_avg)
Round all results to 2 decimal places
Return the result table ordered by efficiency improvement in descending order, then by driver name in ascending order.

columns - driver_id, driver_name, first_half_avg, second_half_avg, efficiency_improvement 
'''

#Solution
trips['period'] = np.where(trips['trip_date'].dt.month < 7, 1,2)
trips['eff'] = trips['distance_km']/trips['fuel_consumed']
t = trips.groupby(['driver_id','period'])['eff'].mean().round(2).reset_index()
t = t.pivot(index = 'driver_id', columns = 'period', values = 'eff').rename_axis(None, axis = 1).reset_index().rename(columns = {1 : 'first_half_avg', 2 : 'second_half_avg'}) 
t = t[(t['first_half_avg'].notnull()) & (t['second_half_avg'].notnull()) & (t['first_half_avg']<t['second_half_avg'])]
t['efficiency_improvement'] = (t['second_half_avg'] - t['first_half_avg']).round(2)
t.merge(drivers, on = 'driver_id', how = 'left').iloc[:,[0,4,1,2,3]].sort_values(['efficiency_improvement', 'driver_name'], ascending = [0,1])

,driver_id,driver_name,first_half_avg,second_half_avg,efficiency_improvement
1,2,Bob Smith,11.24,13.33,2.09
0,1,Alice Johnson,11.97,14.02,2.05

In [86]:
##3611 - Find Overbooked Employees

#DF
data = [[1, 'Alice Johnson', 'Engineering'], [2, 'Bob Smith', 'Marketing'], [3, 'Carol Davis', 'Sales'], [4, 'David Wilson', 'Engineering'], [5, 'Emma Brown', 'HR']]
employees = pd.DataFrame(data, columns=['employee_id', 'employee_name', 'department']).astype({'employee_id': 'Int64', 'employee_name': 'string', 'department': 'string'})

data = [[1, 1, '2023-06-05', 'Team', 8.0], [2, 1, '2023-06-06', 'Client', 6.0], [3, 1, '2023-06-07', 'Training', 7.0], [4, 1, '2023-06-12', 'Team', 12.0], [5, 1, '2023-06-13', 'Client', 9.0], [6, 2, '2023-06-05', 'Team', 15.0], [7, 2, '2023-06-06', 'Client', 8.0], [8, 2, '2023-06-12', 'Training', 10.0], [9, 3, '2023-06-05', 'Team', 4.0], [10, 3, '2023-06-06', 'Client', 3.0], [11, 4, '2023-06-05', 'Team', 25.0], [12, 4, '2023-06-19', 'Client', 22.0], [13, 5, '2023-06-05', 'Training', 2.0]]
meetings = pd.DataFrame(data, columns=['meeting_id', 'employee_id', 'meeting_date', 'meeting_type', 'duration_hours']).astype({'meeting_id': 'Int64', 'employee_id': 'Int64', 'meeting_date': 'datetime64[ns]', 'meeting_type': 'string', 'duration_hours': 'float64'})

#Task
'''
Write a solution to find employees who are meeting-heavy - employees who spend more than 50% of their working time in meetings during any given week.

Assume a standard work week is 40 hours
Calculate total meeting hours per employee per week (Monday to Sunday)
An employee is meeting-heavy if their weekly meeting hours > 20 hours (50% of 40 hours)
Count how many weeks each employee was meeting-heavy
Only include employees who were meeting-heavy for at least 2 weeks
Return the result table ordered by the number of meeting-heavy weeks in descending order, then by employee name in ascending order.

columns - employee_id, employee_name, department, meeting_heavy_weeks 
'''

#Solution
meetings['week'] = meetings['meeting_date'].dt.isocalendar().week
m = meetings.groupby(['employee_id','week'])['duration_hours'].sum().reset_index()
m['meeting_heavy_weeks'] = np.where(m['duration_hours'] > 20, 1, 0)
m = m.groupby('employee_id')['meeting_heavy_weeks'].sum().reset_index(name = 'meeting_heavy_weeks').query('meeting_heavy_weeks > 1')
m.merge(employees, how = 'left', on = 'employee_id').sort_values(['meeting_heavy_weeks','employee_name'], ascending = [0,1]).iloc[:,[0,2,3,1]]

   employee_id  employee_name   department  meeting_heavy_weeks
0            1  Alice Johnson  Engineering                    2
1            4   David Wilson  Engineering                    2

In [87]:
##3626 - Find Stores with Inventory Imbalance

#DF
data = [[1, 'Downtown Tech', 'New York'], [2, 'Suburb Mall', 'Chicago'], [3, 'City Center', 'Los Angeles'], [4, 'Corner Shop', 'Miami'], [5, 'Plaza Store', 'Seattle']]
stores = pd.DataFrame(data, columns=['store_id', 'store_name', 'location']).astype({'store_id': 'int64', 'store_name': 'string', 'location': 'string'})

data = [[1, 1, 'Laptop', 5, 999.99], [2, 1, 'Mouse', 50, 19.99], [3, 1, 'Keyboard', 25, 79.99], [4, 1, 'Monitor', 15, 299.99], [5, 2, 'Phone', 3, 699.99], [6, 2, 'Charger', 100, 25.99], [7, 2, 'Case', 75, 15.99], [8, 2, 'Headphones', 20, 149.99], [9, 3, 'Tablet', 2, 499.99], [10, 3, 'Stylus', 80, 29.99], [11, 3, 'Cover', 60, 39.99], [12, 4, 'Watch', 10, 299.99], [13, 4, 'Band', 25, 49.99], [14, 5, 'Camera', 8, 599.99], [15, 5, 'Lens', 12, 199.99]]
inventory = pd.DataFrame(data, columns=['inventory_id', 'store_id', 'product_name', 'quantity', 'price']).astype({'inventory_id': 'int64', 'store_id': 'int64', 'product_name': 'string', 'quantity': 'int64', 'price': 'float64'})

#DF
'''
Write a solution to find stores that have inventory imbalance - stores where the most expensive product has lower stock than the cheapest product.

For each store, identify the most expensive product (highest price) and its quantity
For each store, identify the cheapest product (lowest price) and its quantity
A store has inventory imbalance if the most expensive product's quantity is less than the cheapest product's quantity
Calculate the imbalance ratio as (cheapest_quantity / most_expensive_quantity)
Round the imbalance ratio to 2 decimal places
Only include stores that have at least 3 different products
Return the result table ordered by imbalance ratio in descending order, then by store name in ascending order.

columns - store_id, store_name, location, most_exp_product, cheapest_product, imbalance_ratio
'''

#Solution
round2 = lambda x : round(x + 1e-9,2)
s = inventory.groupby('store_id').size().reset_index(name = 'count').query('count > 2')['store_id']
i = inventory[inventory['store_id'].isin(s)]

max_value = i.sort_values(['store_id','price'],ascending = [1,0]).groupby('store_id').head(1)
min_value = i.sort_values(['store_id','price'],ascending = [1,1]).groupby('store_id').head(1)

m = max_value.merge(min_value, on = 'store_id', how = 'left',suffixes = ('_max','_min'))
m['imbalance_ratio'] = np.where(m['quantity_max'] < m['quantity_min'], m['quantity_min']/m['quantity_max'],0).astype('float64')
m['imbalance_ratio'] = m['imbalance_ratio'].apply(round2)
m.rename(columns = {'product_name_max' : 'most_exp_product', 'product_name_min' : 'cheapest_product'}, inplace = True)
m.merge(stores, on = 'store_id', how = 'left')[['store_id','store_name','location','most_exp_product','cheapest_product','imbalance_ratio']].sort_values(['imbalance_ratio','store_name'], ascending = [0,1]).query('imbalance_ratio > 0')

,store_id,store_name,location,most_exp_product,cheapest_product,imbalance_ratio
2,3,City Center,Los Angeles,Tablet,Stylus,40.0
1,2,Suburb Mall,Chicago,Phone,Case,25.0
0,1,Downtown Tech,New York,Laptop,Mouse,10.0

In [88]:
##3642 - Find Books with Polarized Opinions

#DF
data = [[1, 'The Great Gatsby', 'F. Scott', 'Fiction', 180], [2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 281], [3, '1984', 'George Orwell', 'Dystopian', 328], [4, 'Pride and Prejudice', 'Jane Austen', 'Romance', 432], [5, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 277]]
books = pd.DataFrame(data, columns = ['book_id','title','author','genre','pages'])

data = [[1, 1, 'Alice', 50, 5], [2, 1, 'Bob', 60, 1], [3, 1, 'Carol', 40, 4], [4, 1, 'David', 30, 2], [5, 1, 'Emma', 45, 5], [6, 2, 'Frank', 80, 4], [7, 2, 'Grace', 70, 4], [8, 2, 'Henry', 90, 5], [9, 2, 'Ivy', 60, 4], [10, 2, 'Jack', 75, 4], [11, 3, 'Kate', 100, 2], [12, 3, 'Liam', 120, 1], [13, 3, 'Mia', 80, 2], [14, 3, 'Noah', 90, 1], [15, 3, 'Olivia', 110, 4], [16, 3, 'Paul', 95, 5], [17, 4, 'Quinn', 150, 3], [18, 4, 'Ruby', 140, 3], [19, 5, 'Sam', 80, 1], [20, 5, 'Tara', 70, 2]]
reading_sessions = pd.DataFrame(data, columns = ['session_id','book_id','reader_name','pages_read','session_rating'])

#Task
'''
Write a solution to find books that have polarized opinions - books that receive both very high ratings and very low ratings from different readers.

A book has polarized opinions if it has at least one rating  4 and at least one rating  2
Only consider books that have at least 5 reading sessions
Calculate the rating spread as (highest_rating - lowest_rating)
Calculate the polarization score as the number of extreme ratings (ratings  2 or  4) divided by total sessions
Only include books where polarization score  0.6 (at least 60% extreme ratings)
Return the result table ordered by polarization score in descending order, then by title in descending order.
The polarization score should be rounded to 2 decimal places.

columns -  book_id, title, author, genre, pages, rating_spread, polarization_score
'''

#Solution
round2 = lambda x : round(x + 1e-9,2)

r = reading_sessions
r['ratingisnot3'] = r['session_rating'] != 3
r = r.groupby('book_id').agg(
    maxv = ('session_rating','max'),
    minv = ('session_rating','min'),
    count = ('session_rating','size'),
    countx = ('ratingisnot3', 'sum')).reset_index()

r['rating_spread'] = r['maxv'] - r['minv']
r['polarization_score'] = (r['countx']/r['count']).apply(round2)

r[(r['polarization_score'] >= 0.6) & (r['maxv'] >=4) & (r['minv'] <= 2) & (r['count'] > 4)].merge(books, on = 'book_id', how = 'left').iloc[:,[0,7,8,9,10,5,6]].sort_values(['polarization_score','title'],ascending = [0,0])

,book_id,title,author,genre,pages,rating_spread,polarization_score
0,1,The Great Gatsby,F. Scott,Fiction,180,4,1.0
1,3,1984,George Orwell,Dystopian,328,4,1.0

In [89]:
##3657 - Find Loyal Customers

#DF
data = [[1, 101, '2024-01-05', 150.0, 'purchase'], [2, 101, '2024-01-15', 200.0, 'purchase'], [3, 101, '2024-02-10', 180.0, 'purchase'], [4, 101, '2024-02-20', 250.0, 'purchase'], [5, 102, '2024-01-10', 100.0, 'purchase'], [6, 102, '2024-01-12', 120.0, 'purchase'], [7, 102, '2024-01-15', 80.0, 'refund'], [8, 102, '2024-01-18', 90.0, 'refund'], [9, 102, '2024-02-15', 130.0, 'purchase'], [10, 103, '2024-01-01', 500.0, 'purchase'], [11, 103, '2024-01-02', 450.0, 'purchase'], [12, 103, '2024-01-03', 400.0, 'purchase'], [13, 104, '2024-01-01', 200.0, 'purchase'], [14, 104, '2024-02-01', 250.0, 'purchase'], [15, 104, '2024-02-15', 300.0, 'purchase'], [16, 104, '2024-03-01', 350.0, 'purchase'], [17, 104, '2024-03-10', 280.0, 'purchase'], [18, 104, '2024-03-15', 100.0, 'refund']]
customer_transactions = pd.DataFrame(data, columns = ['transaction_id','customer_id','transaction_date','amount','transaction_type'])

#Task
'''
Write a solution to find loyal customers. A customer is considered loyal if they meet ALL the following criteria:

Made at least 3 purchase transactions.
Have been active for at least 30 days.
Their refund rate is less than 20% .
Refund rate is the proportion of transactions that are refunds, calculated as the number of refund transactions divided by 
the total number of transactions (purchases plus refunds).

Return the result table ordered by customer_id in ascending order.

columns - customer_id
'''

#Solution
c = customer_transactions
c['transaction_date'] = c['transaction_date'].astype('datetime64[ns]')
c['refund'] = np.where(c['transaction_type'] == 'refund',1,0)

c = c.groupby('customer_id').agg(
    transaction = ('transaction_type','size'),
    refund = ('refund','sum'),
    min_date = ('transaction_date','min'),
    max_date = ('transaction_date','max')).reset_index()

c['refund_rate'] = c['refund']/c['transaction']
c['active'] = (c['max_date'] - c['min_date']).dt.days

c[(c['transaction']>2) & (c['refund_rate'] < 0.2) & (c['active'] >= 30)].sort_values('customer_id')[['customer_id']]

   customer_id
0          101
3          104

In [90]:
##3705 - Find Golden Hour Customers

#DF
data = [[1, 101, '2024-03-01 12:30:00', 25.5, 'card', 5], [2, 101, '2024-03-02 19:15:00', 32.0, 'app', 4], [3, 101, '2024-03-03 13:45:00', 28.75, 'card', 5], [4, 101, '2024-03-04 20:30:00', 41.0, 'app', None], [5, 102, '2024-03-01 11:30:00', 18.5, 'cash', 4], [6, 102, '2024-03-02 12:00:00', 22.0, 'card', 3], [7, 102, '2024-03-03 15:30:00', 19.75, 'cash', None], [8, 103, '2024-03-01 19:00:00', 55.0, 'app', 5], [9, 103, '2024-03-02 20:45:00', 48.5, 'app', 4], [10, 103, '2024-03-03 18:30:00', 62.0, 'card', 5], [11, 104, '2024-03-01 10:00:00', 15.0, 'cash', 3], [12, 104, '2024-03-02 09:30:00', 18.0, 'cash', 2], [13, 104, '2024-03-03 16:00:00', 20.0, 'card', 3], [14, 105, '2024-03-01 12:15:00', 30.0, 'app', 4], [15, 105, '2024-03-02 13:00:00', 35.5, 'app', 5], [16, 105, '2024-03-03 11:45:00', 28.0, 'card', 4]]
restaurant_orders = pd.DataFrame(data, columns = ['order_id','customer_id','order_timestamp','order_amount','payment_method','order_rating'])

#Task
'''
Write a solution to find golden hour customers - customers who consistently order during peak hours and provide high satisfaction. A customer is a golden hour customer if they meet ALL the following criteria:

Made at least 3 orders.
At least 60% of their orders are during peak hours (11:00-14:00 or 18:00-21:00).
Their average rating for rated orders is at least 4.0, round it to 2 decimal places.
Have rated at least 50% of their orders.
Return the result table ordered by average_rating in descending order, then by customer_id in descending order.

columns -  customer_id, total_orders, peak_hour_percentage, average_rating
'''

#Solution
r = restaurant_orders
r['order_timestamp'] = r['order_timestamp'].astype('datetime64[ns]')
index = r.set_index('order_timestamp')
range1 = index.between_time('11:00','14:00')
range2 = index.between_time('18:00','21:00')
rangex = pd.concat([range1,range2]).sort_index()
rangex = rangex.groupby('customer_id').size().reset_index(name = 'count_gh')
rangex

r = r.groupby('customer_id').agg(
        total_orders = ('customer_id', 'size'),
        average_rating = ('order_rating', lambda x: round(x.mean() + 1e-09,2)),
        rating_count = ('order_rating', lambda x : (x > 0).sum())).reset_index()

r = r.merge(rangex, on = 'customer_id', how = 'left').fillna(0)
r['peak_hour_percentage'] = ((r['count_gh']/r['total_orders'])*100).round(0)
r['rate_percentage'] = r['rating_count']/r['total_orders']
r[(r['peak_hour_percentage']>=0.6) & (r['average_rating']>=4) & (r['rate_percentage']>=0.5) & (r['total_orders']>=3)][['customer_id','total_orders','peak_hour_percentage','average_rating']].sort_values(['average_rating','customer_id'],ascending = [0,0])

   customer_id  total_orders  peak_hour_percentage  average_rating
2          103             3                 100.0            4.67
0          101             4                 100.0            4.67
4          105             3                 100.0            4.33

In [91]:
##3716 - Find Churn Risk Customers

#DF
data = [[1, 501, '2024-01-01', 'start', 'premium', 29.99], [2, 501, '2024-02-15', 'downgrade', 'standard', 19.99], [3, 501, '2024-03-20', 'downgrade', 'basic', 9.99], [4, 502, '2024-01-05', 'start', 'standard', 19.99], [5, 502, '2024-02-10', 'upgrade', 'premium', 29.99], [6, 502, '2024-03-15', 'downgrade', 'basic', 9.99], [7, 503, '2024-01-10', 'start', 'basic', 9.99], [8, 503, '2024-02-20', 'upgrade', 'standard', 19.99], [9, 503, '2024-03-25', 'upgrade', 'premium', 29.99], [10, 504, '2024-01-15', 'start', 'premium', 29.99], [11, 504, '2024-03-01', 'downgrade', 'standard', 19.99], [12, 504, '2024-03-30', 'cancel', None, 0.0], [13, 505, '2024-02-01', 'start', 'basic', 9.99], [14, 505, '2024-02-28', 'upgrade', 'standard', 19.99], [15, 506, '2024-01-20', 'start', 'premium', 29.99], [16, 506, '2024-03-10', 'downgrade', 'basic', 9.99]]
subscription_events = pd.DataFrame(data, columns = ['event_id','user_id','event_date','event_type','plan_name','monthly_amount'])

#Task
'''
Write a solution to Find Churn Risk Customers - users who show warning signs before churning. A user is considered churn risk customer 
if they meet ALL the following criteria:

Currently have an active subscription (their last event is not cancel).
Have performed at least one downgrade in their subscription history.
Their current plan revenue is less than 50% of their historical maximum plan revenue.
Have been a subscriber for at least 60 days.
Return the result table ordered by days_as_subscriber in descending order, then by user_id in ascending order.

columns - user_id, current_plan, current_monthly_amount, max_historical_amount, days_as_subscriber
'''

#Solution
s = subscription_events
s['event_date'] = s['event_date'].astype('datetime64[ns]')
s = s.sort_values(['user_id','event_date'],ascending = [1,1]).groupby('user_id').agg(
    current_plan = ('plan_name','last'),
    current_monthly_amount = ('monthly_amount','last'),
    max_historical_amount = ('monthly_amount','max'),
    downgrade = ('event_type', lambda x: (x == 'downgrade').sum()),
    active = ('event_type', 'last'),
    start_sub = ('event_date','first'),
    end_sub = ('event_date','last')).reset_index()

s['rate'] = s['current_monthly_amount']/s['max_historical_amount']
s['days_as_subscriber'] = (s['end_sub'] - s['start_sub']).dt.days

s[(s['active'] != 'cancel') & (s['rate'] < 0.5) & (s['days_as_subscriber'] >= 60) & (s['downgrade'] > 0)].iloc[:,[0,1,2,3,9]].sort_values(['days_as_subscriber','user_id'], ascending = [0,1])

,user_id,current_plan,current_monthly_amount,max_historical_amount,days_as_subscriber
0,501,basic,9.99,29.99,79
1,502,basic,9.99,29.99,70

In [92]:
##3808 - Find Emotionally Consistent Users

#DF
data = [[1, 101, 'like'], [1, 102, 'like'], [1, 103, 'like'], [1, 104, 'wow'], [1, 105, 'like'], [2, 201, 'like'], [2, 202, 'wow'], [2, 203, 'sad'], [2, 204, 'like'], [2, 205, 'wow'], [3, 301, 'love'], [3, 302, 'love'], [3, 303, 'love'], [3, 304, 'love'], [3, 305, 'love']]
reactions = pd.DataFrame(data, columns = ['user_id','content_id','reaction'])

#Task
'''
Write a solution to identify emotionally consistent users based on the following requirements:

For each user, count the total number of reactions they have given.
Only include users who have reacted to at least 5 different content items.
A user is considered emotionally consistent if at least 60% of their reactions are of the same type.
Return the result table ordered by reaction_ratio in descending order and then by user_id in ascending order.

Note: reaction_ratio should be rounded to 2 decimal places

columns - user_id, dominant_reaction, reaction_ratio 
'''

#Solution
r1 = reactions.groupby('user_id').size().reset_index(name = 'total').query('total >= 5')
r2 = reactions.groupby(['user_id','reaction']).size().reset_index(name = 'count')

r = r2.merge(r1, on = 'user_id', how = 'left').query('count/total >= 0.6')
r['reaction_ratio'] = (r['count']/r['total']+1e-9).round(2)
r[['user_id','reaction','reaction_ratio']].rename(columns = {'reaction' : 'dominant_reaction'}).sort_values(['reaction_ratio','user_id'], ascending = [0,1])

   user_id dominant_reaction  reaction_ratio
5        3              love             1.0
0        1              like             0.8

In [59]:
##262 - Trips and Users

#DF
data = [['1', '1', '10', '1', 'completed', '2013-10-01'], ['2', '2', '11', '1', 'cancelled_by_driver', '2013-10-01'], ['3', '3', '12', '6', 'completed', '2013-10-01'], ['4', '4', '13', '6', 'cancelled_by_client', '2013-10-01'], ['5', '1', '10', '1', 'completed', '2013-10-02'], ['6', '2', '11', '6', 'completed', '2013-10-02'], ['7', '3', '12', '6', 'completed', '2013-10-02'], ['8', '2', '12', '12', 'completed', '2013-10-03'], ['9', '3', '10', '12', 'completed', '2013-10-03'], ['10', '4', '13', '12', 'cancelled_by_driver', '2013-10-03']]
trips = pd.DataFrame(data, columns=['id', 'client_id', 'driver_id', 'city_id', 'status', 'request_at']).astype({'id':'Int64', 'client_id':'Int64', 'driver_id':'Int64', 'city_id':'Int64', 'status':'object', 'request_at':'object'})

data = [['1', 'No', 'client'], ['2', 'Yes', 'client'], ['3', 'No', 'client'], ['4', 'No', 'client'], ['10', 'No', 'driver'], ['11', 'No', 'driver'], ['12', 'No', 'driver'], ['13', 'No', 'driver']]
users = pd.DataFrame(data, columns=['users_id', 'banned', 'role']).astype({'users_id':'Int64', 'banned':'object', 'role':'object'})

#Task
'''
The cancellation rate is computed by dividing the number of canceled (by client or driver) requests with unbanned users 
by the total number of requests with unbanned users on that day.

Write a solution to find the cancellation rate of requests with unbanned users (both client and driver must not be banned) 
each day between "2013-10-01" and "2013-10-03" with at least one trip. Round Cancellation Rate to two decimal points.

columns - Day, Cancellation Rate
'''

u = users[users['banned'] != 'Yes']['users_id']
t = trips[(trips['client_id'].isin(u)) & (trips['driver_id'].isin(u)) & trips['request_at'].between('2013-10-01','2023-10-03')]
t = t.groupby('request_at').agg(
    cancel = ('status', lambda x : (1 + 1e-9 - sum(np.where(x == 'completed', 1, 0))/x.size).round(2))).reset_index()

'''
t.groupby('request_at')['status'].apply(lambda x : (x != 'completed').mean()).reset_index()
'''

t.rename(columns = {'request_at' : 'Day', 'cancel' : 'Cancellation Rate'})[['Day','Cancellation Rate']]

          Day  Cancellation Rate
0  2013-10-01               0.33
1  2013-10-02               0.00
2  2013-10-03               0.50